
/*---------------------------------------------------------
	東方模倣風 ～ Toho Imitation Style.
	http://code.google.com/p/kene-touhou-mohofu/
	-------------------------------------------------------
	このファイルは /src/core/draw/gu_draw_screen.c からインクルードされます。
---------------------------------------------------------*/

static VIRTUAL_OBJ_STATE obj_status_table[(OBJ_BANK_MAX*OBJ_BANK_SIZE)/*(6*8*8)*/] =
{
/* [OBJ_BANK_00_TAMA] */
//1 小丸弾(グループ弾)
	{  0,15, 10,10},//白[星点]	// BULLET_MARU10_BASE
	{ 11,15, 10,10},//赤
	{ 22,15, 10,10},//紫
	{ 33,15, 10,10},//青
	{ 44,15, 10,10},//水
	{ 55,15, 10,10},//緑
	{ 66,15, 10,10},//黄
	{ 77,15, 10,10},//橙
//2 米弾(グループ弾)
	{112,18,  7,12},//白	// BULLET_KOME_BASE
	{112,31,  7,12},//赤
	{120,18,  7,12},//紫
	{120,31,  7,12},//青
	{120,44,  7,12},//水
	{120,57,  7,12},//緑
	{120,70,  7,12},//黄
	{120,83,  7,12},//橙
//3 ミニ弾(グループ弾)
	{  0,39,  8, 8},//白	// BULLET_MINI8_BASE
	{  9,39,  8, 8},//赤
	{ 18,39,  8, 8},//紫
	{ 27,39,  8, 8},//青
	{ 36,39,  8, 8},//水
	{ 45,39,  8, 8},//緑
	{ 54,39,  8, 8},//黄
	{ 63,39,  8, 8},//橙
//4 枠付き中丸弾(グループ弾)
	{  0,26, 12,12},//白	// BULLET_WAKU12_BASE
	{ 13,26, 12,12},//赤
	{ 26,26, 12,12},//紫	BULLET_WAKU12_02_KURO_AKA,//	レミリア用の黒枠赤弾	{112,44,  7,12},// BULLET_CAP16_04_KOME_SIROI	/* [青白米弾] */
	{ 39,26, 12,12},//青
	{ 52,26, 12,12},//水	//(r35)	{104,48,  7,12},//水	BULLET_CAP16_04_TUTU_SIROI	/* [青白実包弾] */	{ 52,26, 12,12},
	{ 65,26, 12,12},//緑
	{ 78,26, 12,12},//黄	//	{108, 0,  8, 8},
	{ 91,26, 12,12},//橙	//	{117, 0,  8, 8},
//5 ふぐちり弾(鱗弾) (グループ弾)
	{  0, 0, 15,14},//白	// BULLET_UROKO14_BASE
	{ 16, 0, 15,14},//赤
	{ 32, 0, 15,14},//紫
	{ 48, 0, 15,14},//青
	{ 64, 0, 15,14},//水
	{ 80, 0, 15,14},//緑
	{ 96, 0, 15,14},//黄
	{112, 0, 15,14},//橙
//6 クナイ弾(グループ弾)
	{  0,48,  7,15},//白	// BULLET_KUNAI12_BASE
	{  8,48,  7,15},//赤
	{ 16,48,  7,15},//紫
	{ 24,48,  7,15},//青
	{ 32,48,  7,15},//水
	{ 40,48,  7,15},//緑
	{ 48,48,  7,15},//黄
	{ 56,48,  7,15},//橙
//7 札弾 / ナイフ弾
	{ 64,48, 11,14},//(r35)青 BULLET_OFUDA12_00_AOI,
	{ 88,48, 11,14},//(r35)紫 BULLET_OFUDA12_01_AKA,
	{100,48, 11,14},//(r35)緑 BULLET_OFUDA12_02_YUKARI,
	{104,26,  7,12},//(r35)		BULLET_CAP16_04_TUTU_SIROI//	{ 94,48,  9,14},// BULLET_OFUDA12_03_MIDORI,
	{ 64,63, 10,23},// BULLET_KNIFE20_04_AOI,
	{ 75,63, 10,23},// BULLET_KNIFE20_05_AKA,
	{ 86,63, 10,23},// BULLET_KNIFE20_06_YUKARI,
	{ 97,63, 10,23},// BULLET_KNIFE20_07_MIDORI,
//8 針弾 / 大玉弾
	{  0,64,  5,32},// BULLET_HARI32_00_AOI
	{  6,64,  5,32},// BULLET_HARI32_01_AKA
	{ 12,64,  5,32},// BULLET_HARI32_02_KIIRO
	{ 18,64,  5,32},// BULLET_HARI32_03_DAIDAI
	{  0,96, 31,31},// BULLET_OODAMA32_00_AOI,
	{ 32,96, 31,31},// BULLET_OODAMA32_01_AKA,
	{ 64,96, 31,31},// BULLET_OODAMA32_02_KIIRO,
	{ 96,96, 31,31},// BULLET_OODAMA32_03_MIDORI,



/* --- ITEM面 ---
現状だと著しく効率悪い気がする
*/
/* [OBJ_BANK_01_ITEM] */
// [1]
	{ 27, 74, 10, 10},//	SP_ITEM_00_P001 	/* [p]小 */
	{ 38, 70, 12, 12},//	SP_ITEM_01_P008,	/* [P]大 */
	{ 51, 70, 12, 12},//	SP_ITEM_02_P128,	/* [F] */
	{ 38, 83, 12, 12},//	SP_ITEM_03_1UP, 	/* [1up] */
	{ 51, 83, 12, 12},//	SP_ITEM_04_BOMB,	/* [B] */
	{ 27, 85, 10, 10},//	SP_ITEM_05_TENSU,	/* [点] */
	{  0, 15, 10, 10},//	SP_ITEM_06_HOSI,	/* [☆] */	/* とりあえず */
	{  1,  1,  1,  1},//	SP_ITEM_07_SPECIAL,
// [2]
	{ 88, 19,  8,  6},//	SP_ITEM_00_P001 	/* [p]小 */
	{ 72, 39,  9,  8},//	SP_ITEM_01_P008,	/* [P]大 */
	{ 82, 39,  9,  8},//	SP_ITEM_02_P128,	/* [F] */
	{ 92, 39,  9,  8},//	SP_ITEM_03_1UP, 	/* [1up] */
	{102, 39,  9,  8},//	SP_ITEM_04_BOMB,	/* [B] */
	{ 97, 19,  8,  6},//	SP_ITEM_05_TENSU,	/* [点] */
	{  1,  1,  1,  1},//	SP_ITEM_06_HOSI,	/* [☆] */
	{  1,  1,  1,  1},//	SP_ITEM_07_SPECIAL,
// [3]
	{  0,  0,  8,  8},//	J,"東"logo
	{  0,  0,  8,  8},//	J,"方"logo
	{  0,  0,  8,  8},//	J,"模"logo
	{  0,  0,  8,  8},//	J,"倣"logo
	{  0,  0,  8,  8},//	J,"風"logo
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [4]
	{  0,  0,  8,  8},//	J,"Start"
	{  0,  0,  8,  8},//	J,"Extra Start"
	{  0,  0,  8,  8},//	J,"Practice Start"
	{  0,  0,  8,  8},//	J,"Replay" / "Story"
	{  0,  0,  8,  8},//	J,"Result"
	{  0,  0,  8,  8},//	J,"Music Room"
	{  0,  0,  8,  8},//	J,"Option"
	{  0,  0,  8,  8},//	J,"Quit"
// [5]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [6]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [8]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,

/* --- フロント面 --- */
/* [OBJ_BANK_02_FRONT_BANK0] */
// [1]
	{128,  0,  6,  6},//	JIKI_CORE_00_REIMU_A
	{135,  0,  6,  6},//	JIKI_CORE_01_REIMU_B
	{142,  0,  6,  6},//	JIKI_CORE_02_MARISA_A
	{149,  0,  6,  6},//	JIKI_CORE_03_MARISA_B
	{156,  0,  6,  6},//	JIKI_CORE_05_REMILIA
	{163,  0,  6,  6},//	JIKI_CORE_07_YUYUKO
	{170,  0,  6,  6},//	JIKI_CORE_06_CHIRNO_A
	{177,  0,  6,  6},//	JIKI_CORE_06_CHIRNO_Q
// [2] ポーズメニュー用
	{  0,  0,  1,  1},//	CORE_HIDE_10_REIMU_A,		// "続ける" "CONTINUE GAME"
	{  0,  0,  1,  1},//	CORE_HIDE_11_REIMU_B,		// "始めから" "RESTART GAME"
	{  0,  0,  1,  1},//	CORE_HIDE_12_MARISA_A,		// "メニューに戻る" "QUIT GAME"
	{  0,  0,  1,  1},//	CORE_HIDE_13_MARISA_B,		//
	{  0,  0,  1,  1},//	CORE_HIDE_14_MARISA_C,		//
	{  0,  0,  1,  1},//	CORE_HIDE_15_REMILIA,		//
	{  0,  0,  1,  1},//	CORE_HIDE_16_CHIRNO,		//
	{  0,  0,  1,  1},//	CORE_HIDE_17_YUYUKO,		//
// [3]//	/* 小爆発 / ザコ消滅爆発(フロント面エフェクト) */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [4]//	/* 火炎爆発(フロント面エフェクト) */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [5]
	{  0, 17, 14, 14},//	SPELL_SQUERE_,	/* [□] */
	{192,172, 40, 10},//	J,"Extra"40x10ローマ文字,
	{219,  0,  4,  4},//	SP_FRONT_YUKI, FRONT 面なのであたり判定なし。(とりあえず仮で)雪みたいな表示。
	{129, 18, 32, 10},//	J,"MAX"32x10ローマ文字,
	{192,128, 32, 10},//	J,"Easy"32x10ローマ文字,
	{192,139, 40, 10},//	J,"Normal"40x10ローマ文字,
	{192,150, 32, 10},//	J,"Hard"32x10ローマ文字,
	{192,161, 48, 10},//	J,"Lunatic"48x10ローマ文字,
// [6]
	{129,  7,  8, 10},//	"0"8x10ローマ数字,[r39]
	{138,  7,  8, 10},//	"1"8x10ローマ数字,[r39]
	{147,  7,  8, 10},//	"2"8x10ローマ数字,[r39]
	{156,  7,  8, 10},//	"3"8x10ローマ数字,[r39]
	{165,  7,  8, 10},//	"4"8x10ローマ数字,[r39]
	{174,  7,  8, 10},//	"5"8x10ローマ数字,[r39]
	{183,  7,  8, 10},//	"6"8x10ローマ数字,[r39]
	{192,  7,  8, 10},//	"7"8x10ローマ数字,[r39]
// [7]
	{201,  7,  8, 10},//	"8"8x10ローマ数字,[r39]
	{210,  7,  8, 10},//	"9"8x10ローマ数字,[r39]
	{  0,  0,  1,  1},//	" "8x10ローマ数字,[r39](空白) 	{  0, 32,  1,  1},//	SP_DUMMY_MUTEKI, FRONT 面なのであたり判定なし。それから表示されない。
	{218, 18, 32, 10},//	J,"Time:"32x10ローマ文字,
	{193, 18, 24, 10},//	J,"fps"24x10ローマ文字,
	{192,183, 39, 10},//	"ene my"39x10ローマ文字,
	{129,  0,  8,  6},//	"〇"8x6漢字,
	{138,  0,  8,  6},//	"一"8x6漢字,
// [8]
	{147,  0,  8,  6},//	"二"8x6漢字,
	{156,  0,  8,  6},//	"三"8x6漢字,
	{165,  0,  8,  6},//	"四"8x6漢字,
	{174,  0,  8,  6},//	"五"8x6漢字,
	{183,  0,  8,  6},//	"六"8x6漢字,
	{192,  0,  8,  6},//	"七"8x6漢字,
	{201,  0,  8,  6},//	"八"8x6漢字,
	{210,  0,  8,  6},//	"九"8x6漢字,

/* [OBJ_BANK_08_TITLE] */

/* --- タイトル画面用バンク --- */
/* [OBJ_BANK_03_TITLE_dummy] */ 	/*[予定]*/
// [1]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [2]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [3]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [4]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [5]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [6]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [8]
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,

//-----------------------------------------------------------------------
//-----------------------------------------------------------------------


//
/* [OBJ_BANK_01_REIMU_A] */
//[00霊夢A、霊符]
// [5]
	{  0, 96, 11, 11},//	JIKI_OPTION_00_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_07,

//						//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]					//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= OBJ_Z01_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */

// [6]
	{  0, 96, 11, 11},//	JIKI_OPTION_01_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_07,

// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  0,  0,  8,  8},//	JIKI_ETC_00,		/* --- 未使用 --- */
	{  0,  0,  8,  8},//	JIKI_ETC_01,		/* --- 未使用 --- */
	{  0,  0,  8,  8},//	JIKI_ETC_02,		/* --- 未使用 --- */
	{  0,  0,  8,  8},//	JIKI_ETC_03,		/* --- 未使用 --- */

// [7]
	{  0, 96, 11, 11},//	JIKI_OPTION_02_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_07,

// [3]
	{153,  0,102,155},//	JIKI_BOMBER_00, 	/* ボンバー発動時の立ち絵 */
	{  0,176, 80, 80},//	JIKI_BOMBER_01, 	/* 誘導ボム(低速ボム)	 */
	{  0,128,127,127},//	JIKI_BOMBER_02, 	/* --- 未使用 --- / 結界白 / 長炎1 */
	{128,128,127,127},//	JIKI_BOMBER_03, 	/* --- 未使用 --- / 結界黄 / 長炎2 */
	{  0,108, 32, 31},//	JIKI_BOMBER_04, 	/* 黄札1 / 星1 / 十字炎1 / 蝶1 / チ */
	{ 33,108, 32, 31},//	JIKI_BOMBER_05, 	/* 黄札2 / 星2 / 十字炎2 / 蝶2 / ル */
	{ 66,108, 32, 31},//	JIKI_BOMBER_06, 	/* 黄札3 / 星3 / 十字炎3 / 蝶3 / ノ */
	{ 99,108, 32, 31},//	JIKI_BOMBER_07, 	/* 黄札4 / 星4 / 十字炎4 / 蝶4 / ⑨ */

// [8]
	{  0, 96, 11, 11},//	JIKI_OPTION_03_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_07,

// [4]
	{ 99,108, 32, 31},//	JIKI_SHOT_00,		/* 長炎3 / 赤札C */
	{128,  0, 16, 16},//	JIKI_SHOT_01,		/* [黄回転札1] 長炎4 / 赤札B(霊夢の回転ショット) */
	{  1, 64, 32, 32},//	JIKI_SHOT_02,		/* 赤札A / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{128, 27, 10, 36},//	JIKI_SHOT_07,		/* [針弾霊夢B/赤札霊夢A] / こうもり弾5 /森弾 / ウェイブ弾 / ピンク蝶弾 */


//
/* [OBJ_BANK_02_REIMU_B] */
//[00霊夢B、夢符]
// [5]
	{  0, 96, 11, 11},//	JIKI_OPTION_00_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_07,

//						//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]					//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= OBJ_Z01_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */

// [6]
	{  0, 96, 11, 11},//	JIKI_OPTION_01_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_07,

// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  0,  0, 31, 31},//	JIKI_ETC_00,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_01,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_02,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_03,		/* --- 未使用 --- */

// [7]
	{  0, 96, 11, 11},//	JIKI_OPTION_02_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_07,

// [3]
	{153,  0,102,155},//	JIKI_BOMBER_00, 	/* ボンバー発動時の立ち絵 */
	{  0,176, 80, 80},//	JIKI_BOMBER_01, 	/* 誘導ボム(低速ボム)	 */
	{  0,128,127,127},//	JIKI_BOMBER_02, 	/* --- 未使用 --- / 結界白 / 長炎1 */
	{128,128,127,127},//	JIKI_BOMBER_03, 	/* --- 未使用 --- / 結界黄 / 長炎2 */
	{  0,108, 32, 31},//	JIKI_BOMBER_04, 	/* 黄札1 / 星1 / 十字炎1 / 蝶1 / チ */
	{ 33,108, 32, 31},//	JIKI_BOMBER_05, 	/* 黄札2 / 星2 / 十字炎2 / 蝶2 / ル */
	{ 66,108, 32, 31},//	JIKI_BOMBER_06, 	/* 黄札3 / 星3 / 十字炎3 / 蝶3 / ノ */
	{ 99,108, 32, 31},//	JIKI_BOMBER_07, 	/* 黄札4 / 星4 / 十字炎4 / 蝶4 / ⑨ */

// [8]
	{  0, 96, 11, 11},//	JIKI_OPTION_03_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_07,

// [4]
	{ 99,108, 32, 31},//	JIKI_SHOT_00,		/* 長炎3 / 赤札C */
	{128,  0, 16, 16},//	JIKI_SHOT_01,		/* [黄回転札1] 長炎4 / 赤札B(霊夢の回転ショット) */
	{  1, 64, 32, 32},//	JIKI_SHOT_02,		/* 赤札A / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{131, 64,  5, 31},//	JIKI_SHOT_07,		/* [針弾霊夢B/赤札霊夢A] / こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */



//
/* [OBJ_BANK_03_MARISA_A] */
// [01魔理沙_A、魔符]
// [5]
	{  0, 96, 11, 11},//	JIKI_OPTION_00_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_07,
//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= OBJ_Z01_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */

// [6]
	{  0, 96, 11, 11},//	JIKI_OPTION_01_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_07,

// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  0,  0, 31, 31},//	JIKI_ETC_00,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_01,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_02,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_03,		/* --- 未使用 --- */

// [7]
	{  0, 96, 11, 11},//	JIKI_OPTION_02_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_07,

// [3]
	{141,  0,114,151},//	JIKI_BOMBER_00, 	/* ボンバー発動時の立ち絵 */
	{ 32, 96, 60, 16},//	JIKI_BOMBER_01, 	/* 誘導ボム(低速ボム)	 */
	{  0,  0, 31, 31},//	JIKI_BOMBER_02, 	/* --- 未使用 --- / 結界白 / 長炎1 */
	{  0,  0, 31, 31},//	JIKI_BOMBER_03, 	/* --- 未使用 --- / 結界黄 / 長炎2 */
	{  0,192, 63, 63},//	JIKI_BOMBER_04, 	/* 黄札1 / 星1 / 十字炎1 / 蝶1 / チ */
	{ 64,192, 63, 63},//	JIKI_BOMBER_05, 	/* 黄札2 / 星2 / 十字炎2 / 蝶2 / ル */
	{128,192, 63, 63},//	JIKI_BOMBER_06, 	/* 黄札3 / 星3 / 十字炎3 / 蝶3 / ノ */
	{192,192, 63, 63},//	JIKI_BOMBER_07, 	/* 黄札4 / 星4 / 十字炎4 / 蝶4 / ⑨ */

// [8]
	{  0, 96, 11, 11},//	JIKI_OPTION_03_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_07,

// [4]
	{  1, 64, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{ 96, 96, 10, 31},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{ 16, 96, 15, 18},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */



//
/* [OBJ_BANK_04_MARISA_B] */
// [01魔理沙_B、恋符]
// [5]
	{  0, 96, 11, 11},//	JIKI_OPTION_00_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_00_07,

//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= OBJ_Z01_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */

// [6]
	{  0, 96, 11, 11},//	JIKI_OPTION_01_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_01_07,

// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  0,  0, 31, 31},//	JIKI_ETC_00,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_01,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_02,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_03,		/* --- 未使用 --- */

// [7]
	{  0, 96, 11, 11},//	JIKI_OPTION_02_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_02_07,

// [3]
	{141,  0,114,151},//	JIKI_BOMBER_00, 	/* ボンバー発動時の立ち絵 */
	{ 96,128, 10, 36},//	JIKI_BOMBER_01, 	/* 誘導ボム(低速ボム)	 */
	{  0,  0, 31, 31},//	JIKI_BOMBER_02, 	/* --- 未使用 --- / 結界白 / 長炎1 */
	{  0,  0, 31, 31},//	JIKI_BOMBER_03, 	/* --- 未使用 --- / 結界黄 / 長炎2 */
	{  0,192, 63, 63},//	JIKI_BOMBER_04, 	/* 黄札1 / 星1 / 十字炎1 / 蝶1 / チ */
	{ 64,192, 63, 63},//	JIKI_BOMBER_05, 	/* 黄札2 / 星2 / 十字炎2 / 蝶2 / ル */
	{128,192, 63, 63},//	JIKI_BOMBER_06, 	/* 黄札3 / 星3 / 十字炎3 / 蝶3 / ノ */
	{192,192, 63, 63},//	JIKI_BOMBER_07, 	/* 黄札4 / 星4 / 十字炎4 / 蝶4 / ⑨ */

// [8]
	{  0, 96, 11, 11},//	JIKI_OPTION_03_00,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_01,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_02,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_03,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_04,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_05,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_06,
	{  0, 96, 11, 11},//	JIKI_OPTION_03_07,

// [4]
	{  1, 64, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{ 96, 96, 10, 31},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{121, 96,  6, 87},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */



//
/* [OBJ_BANK_05_REMILIA] */
// [04レミリア]

// [5]
	{  0, 96, 18, 18},//	JIKI_OPTION_00_00,/*{	0, 99, 13, 13}, */
	{  0, 96, 18, 18},//	JIKI_OPTION_00_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_07,

//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= OBJ_Z01_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 32, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */

// [6]
	{  0, 96, 18, 18},//	JIKI_OPTION_01_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_07,

// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  0,  0, 31, 31},//	JIKI_ETC_00,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_01,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_02,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_03,		/* --- 未使用 --- */

// [7]
	{  0, 96, 18, 18},//	JIKI_OPTION_02_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_07,

// [3]
	{143,  0,112,137},//	JIKI_BOMBER_00, 	/* ボンバー発動時の立ち絵 */
	{  0,186, 64, 69},//	JIKI_BOMBER_01, 	/* 誘導ボム(低速ボム)	 */
	{128,138, 31,117},//	JIKI_BOMBER_06, 	/* ---		 / 歪炎B1 / 長炎1 / 結界白 */
	{160,138, 31,117},//	JIKI_BOMBER_07, 	/* ---		 / 歪炎B2 / 長炎2 / 結界黄	*/
	{ 16,128,  4, 16},//	JIKI_BOMBER_02, 	/* 星1 / 蝶1 / 歪炎A1 / 十字炎1 */
	{ 32,128,  4, 16},//	JIKI_BOMBER_03, 	/* 星2 / 蝶2 / 歪炎A2 / 十字炎2 */
	{ 48,128,  4, 16},//	JIKI_BOMBER_04, 	/* 星3 / 蝶3 / 歪炎A3 / 十字炎3 */
	{ 64,128,  4, 16},//	JIKI_BOMBER_05, 	/* 星4 / 蝶4 / 歪炎A4 / 十字炎4 */

// [8]
	{  0, 96, 18, 18},//	JIKI_OPTION_03_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_07,

// [4]
	{192,138, 31,117},//	JIKI_SHOT_00,		/* 歪炎B3 / 長炎3 */
	{224,138, 31,117},//	JIKI_SHOT_01,		/* 歪炎B4 / 長炎4 */
	{128,  0,  6, 26},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */

	{128, 41, 14, 10},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{128, 52, 14, 10},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{128, 63, 14, 10},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{128, 74, 14, 10},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{128, 85, 14, 10},//	JIKI_SHOT_07,		/* 195 こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */


//
/* [OBJ_BANK_05_YUYUKO] */
// [05幽々子]

// [5]
	{  0, 96, 15, 15},//	JIKI_OPTION_00_00,
	{ 16, 96, 15, 15},//	JIKI_OPTION_00_01,
	{ 32, 96, 15, 15},//	JIKI_OPTION_00_02,
	{ 48, 96, 15, 15},//	JIKI_OPTION_00_03,
	{ 64, 96, 15, 15},//	JIKI_OPTION_00_04,
	{ 80, 96, 15, 15},//	JIKI_OPTION_00_05,
	{ 96, 96, 15, 15},//	JIKI_OPTION_00_06,
	{112, 96, 15, 15},//	JIKI_OPTION_00_07,

//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= OBJ_Z01_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */

// [6]
	{ 32, 96, 15, 15},//	JIKI_OPTION_01_00,/* 同じ */
	{ 48, 96, 15, 15},//	JIKI_OPTION_01_01,/* 同じ */
	{ 64, 96, 15, 15},//	JIKI_OPTION_01_02,/* 同じ */
	{ 80, 96, 15, 15},//	JIKI_OPTION_01_03,/* 同じ */
	{ 96, 96, 15, 15},//	JIKI_OPTION_01_04,/* 同じ */
	{112, 96, 15, 15},//	JIKI_OPTION_01_05,/* 同じ */
	{  0, 96, 15, 15},//	JIKI_OPTION_01_06,/* 同じ */
	{ 16, 96, 15, 15},//	JIKI_OPTION_01_07,/* 同じ */

// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  0,  0, 31, 31},//	JIKI_ETC_00,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_01,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_02,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_03,		/* --- 未使用 --- */

// [7]
	{ 64, 96, 15, 15},//	JIKI_OPTION_02_00,/* 同じ */
	{ 80, 96, 15, 15},//	JIKI_OPTION_02_01,/* 同じ */
	{ 96, 96, 15, 15},//	JIKI_OPTION_02_02,/* 同じ */
	{112, 96, 15, 15},//	JIKI_OPTION_02_03,/* 同じ */
	{  0, 96, 15, 15},//	JIKI_OPTION_02_04,/* 同じ */
	{ 16, 96, 15, 15},//	JIKI_OPTION_02_05,/* 同じ */
	{ 32, 96, 15, 15},//	JIKI_OPTION_02_06,/* 同じ */
	{ 48, 96, 15, 15},//	JIKI_OPTION_02_07,/* 同じ */

// [3]
	{161,  0, 94,149},//	JIKI_BOMBER_00, 	/* ボンバー発動時の立ち絵 */
	{100,112,  8,  8},//	JIKI_BOMBER_01, 	/* 赤88弾 / 誘導ボム(低速ボム)	 */
	{ 66,112, 16, 16},//	JIKI_BOMBER_02, 	/* 蝶弾16赤 / 結界白 / 長炎1 */
	{ 83,112, 16, 16},//	JIKI_BOMBER_03, 	/* 蝶弾16青 / 結界黄 / 長炎2 */
	{  0,112, 32, 32},//	{  0,112, 46, 37},//	JIKI_BOMBER_04, 	/* 黄札1 / 星1 / 十字炎1 / 蝶1 / チ */
	{ 33,112, 32, 32},//	{ 47,112, 46, 37},//	JIKI_BOMBER_05, 	/* 黄札2 / 星2 / 十字炎2 / 蝶2 / ル */
	{  0,112, 32, 32},//	{  0,112, 46, 37},//	JIKI_BOMBER_06, 	/* 黄札3 / 星3 / 十字炎3 / 蝶3 / ノ */
	{ 33,112, 32, 32},//	{ 47,112, 46, 37},//	JIKI_BOMBER_07, 	/* 黄札4 / 星4 / 十字炎4 / 蝶4 / ⑨ */

// [8]
	{ 96, 96, 15, 15},//	JIKI_OPTION_03_00,/* 同じ */
	{112, 96, 15, 15},//	JIKI_OPTION_03_01,/* 同じ */
	{  0, 96, 15, 15},//	JIKI_OPTION_03_02,/* 同じ */
	{ 16, 96, 15, 15},//	JIKI_OPTION_03_03,/* 同じ */
	{ 32, 96, 15, 15},//	JIKI_OPTION_03_04,/* 同じ */
	{ 48, 96, 15, 15},//	JIKI_OPTION_03_05,/* 同じ */
	{ 64, 96, 15, 15},//	JIKI_OPTION_03_06,/* 同じ */
	{ 80, 96, 15, 15},//	JIKI_OPTION_03_07,/* 同じ */

// [4]
	{  0,151,197,104},//	JIKI_SHOT_00,		/* 長炎3 / [幽々子ボムの扇本体] */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{128,  0, 18, 31},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{128, 50, 18, 36},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */


//
/* [OBJ_BANK_06_CIRNO_A] */
// [06チルノA (氷符)]
// [5]
	{  0, 96, 15, 15},//	JIKI_OPTION_00_00,
	{ 16, 96, 15, 15},//	JIKI_OPTION_00_01,
	{ 32, 96, 15, 15},//	JIKI_OPTION_00_02,
	{ 48, 96, 15, 15},//	JIKI_OPTION_00_03,
	{ 64, 96, 15, 15},//	JIKI_OPTION_00_04,
	{ 80, 96, 15, 15},//	JIKI_OPTION_00_05,
	{ 96, 96, 15, 15},//	JIKI_OPTION_00_06,
	{112, 96, 15, 15},//	JIKI_OPTION_00_07,

//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= OBJ_Z01_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */

// [6]
	{  0,112, 15, 15},//	JIKI_OPTION_01_00,
	{ 16,112, 15, 15},//	JIKI_OPTION_01_01,
	{ 32,112, 15, 15},//	JIKI_OPTION_01_02,
	{ 48,112, 15, 15},//	JIKI_OPTION_01_03,
	{ 64,112, 15, 15},//	JIKI_OPTION_01_04,
	{ 80,112, 15, 15},//	JIKI_OPTION_01_05,
	{ 96,112, 15, 15},//	JIKI_OPTION_01_06,
	{112,112, 15, 15},//	JIKI_OPTION_01_07,

// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  0,  0, 31, 31},//	JIKI_ETC_00,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_01,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_02,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_03,		/* --- 未使用 --- */

// [7]
	{  0,128, 15, 15},//	JIKI_OPTION_02_00,
	{ 16,128, 15, 15},//	JIKI_OPTION_02_01,
	{ 32,128, 15, 15},//	JIKI_OPTION_02_02,
	{ 48,128, 15, 15},//	JIKI_OPTION_02_03,
	{ 64,128, 15, 15},//	JIKI_OPTION_02_04,
	{ 80,128, 15, 15},//	JIKI_OPTION_02_05,
	{ 96,128, 15, 15},//	JIKI_OPTION_02_06,
	{112,128, 15, 15},//	JIKI_OPTION_02_07,

// [3]
	{139,  0,117,143},//	JIKI_BOMBER_00, 	/* ボンバー発動時の立ち絵 */
	{128, 48,  7, 41},//	JIKI_BOMBER_01, 	/* 誘導ボム(低速ボム)	 */
	{  0,  0, 31, 31},//	JIKI_BOMBER_02, 	/* --- 未使用 --- / 結界白 / 長炎1 */
	{  0,  0, 31, 31},//	JIKI_BOMBER_03, 	/* --- 未使用 --- / 結界黄 / 長炎2 */
	{128, 48,  7, 41},//	JIKI_BOMBER_04, 	/* 黄札1 / 星1 / 十字炎1 / 蝶1 / チ */
	{128, 48,  7, 41},//	JIKI_BOMBER_05, 	/* 黄札2 / 星2 / 十字炎2 / 蝶2 / ル */
	{128, 48,  7, 41},//	JIKI_BOMBER_06, 	/* 黄札3 / 星3 / 十字炎3 / 蝶3 / ノ */
	{128, 48,  7, 41},//	JIKI_BOMBER_07, 	/* 黄札4 / 星4 / 十字炎4 / 蝶4 / ⑨ */

// [8]
	{  0,144, 15, 15},//	JIKI_OPTION_03_00,
	{ 16,144, 15, 15},//	JIKI_OPTION_03_01,
	{ 32,144, 15, 15},//	JIKI_OPTION_03_02,
	{ 48,144, 15, 15},//	JIKI_OPTION_03_03,
	{ 64,144, 15, 15},//	JIKI_OPTION_03_04,
	{ 80,144, 15, 15},//	JIKI_OPTION_03_05,
	{ 96,144, 15, 15},//	JIKI_OPTION_03_06,
	{112,144, 15, 15},//	JIKI_OPTION_03_07,

// [4]
	{  1, 64, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{128,  0,  9, 34},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{128,155, 15, 14},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */


//
/* [OBJ_BANK_07_CIRNO_Q] */
// [07チルノ⑨ (⑨符)]

// [5]
	{  0, 96, 15, 15},//	JIKI_OPTION_00_00,
	{ 16, 96, 15, 15},//	JIKI_OPTION_00_01,
	{ 32, 96, 15, 15},//	JIKI_OPTION_00_02,
	{ 48, 96, 15, 15},//	JIKI_OPTION_00_03,
	{ 64, 96, 15, 15},//	JIKI_OPTION_00_04,
	{ 80, 96, 15, 15},//	JIKI_OPTION_00_05,
	{ 96, 96, 15, 15},//	JIKI_OPTION_00_06,
	{112, 96, 15, 15},//	JIKI_OPTION_00_07,

//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= OBJ_Z01_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */

// [6]
	{  0,112, 15, 15},//	JIKI_OPTION_01_00,
	{ 16,112, 15, 15},//	JIKI_OPTION_01_01,
	{ 32,112, 15, 15},//	JIKI_OPTION_01_02,
	{ 48,112, 15, 15},//	JIKI_OPTION_01_03,
	{ 64,112, 15, 15},//	JIKI_OPTION_01_04,
	{ 80,112, 15, 15},//	JIKI_OPTION_01_05,
	{ 96,112, 15, 15},//	JIKI_OPTION_01_06,
	{112,112, 15, 15},//	JIKI_OPTION_01_07,

// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  0,  0, 31, 31},//	JIKI_ETC_00,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_01,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_02,		/* --- 未使用 --- */
	{  0,  0, 31, 31},//	JIKI_ETC_03,		/* --- 未使用 --- */

// [7]
	{  0,128, 15, 15},//	JIKI_OPTION_02_00,
	{ 16,128, 15, 15},//	JIKI_OPTION_02_01,
	{ 32,128, 15, 15},//	JIKI_OPTION_02_02,
	{ 48,128, 15, 15},//	JIKI_OPTION_02_03,
	{ 64,128, 15, 15},//	JIKI_OPTION_02_04,
	{ 80,128, 15, 15},//	JIKI_OPTION_02_05,
	{ 96,128, 15, 15},//	JIKI_OPTION_02_06,
	{112,128, 15, 15},//	JIKI_OPTION_02_07,

// [3]
	{139,  0,117,143},//	JIKI_BOMBER_00, 	/* ボンバー発動時の立ち絵 */
	{  0,  0, 31, 31},//	JIKI_BOMBER_01, 	/* 誘導ボム(低速ボム)	 */
	{  0,  0, 31, 31},//	JIKI_BOMBER_02, 	/* --- 未使用 --- / 結界白 / 長炎1 */
	{  0,  0, 31, 31},//	JIKI_BOMBER_03, 	/* --- 未使用 --- / 結界黄 / 長炎2 */
	{  0,192, 63, 63},//	JIKI_BOMBER_04, 	/* 黄札1 / 星1 / 十字炎1 / 蝶1 / チ */
	{ 64,192, 63, 63},//	JIKI_BOMBER_05, 	/* 黄札2 / 星2 / 十字炎2 / 蝶2 / ル */
	{128,192, 63, 63},//	JIKI_BOMBER_06, 	/* 黄札3 / 星3 / 十字炎3 / 蝶3 / ノ */
	{192,192, 63, 63},//	JIKI_BOMBER_07, 	/* 黄札4 / 星4 / 十字炎4 / 蝶4 / ⑨ */

// [8]
	{  0,144, 15, 15},//	JIKI_OPTION_03_00,
	{ 16,144, 15, 15},//	JIKI_OPTION_03_01,
	{ 32,144, 15, 15},//	JIKI_OPTION_03_02,
	{ 48,144, 15, 15},//	JIKI_OPTION_03_03,
	{ 64,144, 15, 15},//	JIKI_OPTION_03_04,
	{ 80,144, 15, 15},//	JIKI_OPTION_03_05,
	{ 96,144, 15, 15},//	JIKI_OPTION_03_06,
	{112,144, 15, 15},//	JIKI_OPTION_03_07,

// [4]
	{  1, 64, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{128,  0,  9, 34},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{128,155, 15, 14},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */


//-----------------------------------------------------------------------
//-----------------------------------------------------------------------


/* --- 敵面 --- */
//	ステージ 1のボス(アリス)

/* [OBJ_BANK_21_BOSS_STAGE1] */ 	/* アリス */
// [1]
	{  0,  0, 40, 40},//	J,	/* ボス & 中-ボス[右側1] */
	{ 41,  0, 40, 40},//	J,	/* ボス & 中-ボス[右側2] */
	{ 82,  0, 40, 40},//	J,	/* ボス & 中-ボス[右側3] */
	{123,  0, 40, 40},//	J,	/* ボス & 中-ボス[右側4] */
	{  0, 41, 40, 40},//	J,	/* ボス & 中-ボス[左側1] */
	{ 41, 41, 40, 40},//	J,	/* ボス & 中-ボス[左側2] */
	{ 82, 41, 40, 40},//	J,	/* ボス & 中-ボス[左側3] */
	{123, 41, 40, 40},//	J,	/* ボス & 中-ボス[左側4] */
// [2]
	{  0, 82, 40, 40},//	J,	/* ボス & 中-ボス[中心1] */
	{ 41, 82, 40, 40},//	J,	/* ボス & 中-ボス[中心2] */
	{ 82, 82, 40, 40},//	J,	/* ボス & 中-ボス[中心3] */
	{123, 82, 40, 40},//	J,	/* ボス & 中-ボス[中心4] */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
// [3]
	{180,  0, 18, 24},//	J,	/* 妖精1 */
	{199,  0, 18, 24},//	J,	/* 妖精1 */
	{218,  0, 18, 24},//	J,	/* 妖精1 */
	{237,  0, 18, 24},//	J,	/* 妖精1 */
	{180, 25, 18, 24},//	J,	/* 妖精1 */
	{199, 25, 18, 24},//	J,	/* 妖精1 */
	{218, 25, 18, 24},//	J,	/* 妖精1 */
	{237, 25, 18, 24},//	J,	/* 妖精1 */
// [4]
	{180, 50, 18, 24},//	J,	/* 妖精1 */
	{199, 50, 18, 24},//	J,	/* 妖精1 */
	{218, 50, 18, 24},//	J,	/* 妖精1 */
	{237, 50, 18, 24},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 後ろの魔方陣 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [5]
	{180, 75, 18, 24},//	J,	/* 妖精2 */
	{199, 75, 18, 24},//	J,	/* 妖精2 */
	{218, 75, 18, 24},//	J,	/* 妖精2 */
	{237, 75, 18, 24},//	J,	/* 妖精2 */
	{180,100, 18, 24},//	J,	/* 妖精2 */
	{199,100, 18, 24},//	J,	/* 妖精2 */
	{218,100, 18, 24},//	J,	/* 妖精2 */
	{237,100, 18, 24},//	J,	/* 妖精2 */
// [6]
	{180,125, 18, 13},//	J,	/* 妖精2 */
	{199,125, 18, 13},//	J,	/* 妖精2 */
	{218,125, 18, 13},//	J,	/* 妖精2 */
	{237,125, 18, 13},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{180,150, 18, 13},//	J,	/* 妖精3 */
	{199,150, 18, 13},//	J,	/* 妖精3 */
	{218,150, 18, 13},//	J,	/* 妖精3 */
	{237,150, 18, 13},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
// [8]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{102, 10, 15, 15},//	J,	"Alice Margatroid."

//	ステージ 2のボス(未定)
/* [OBJ_BANK_23_BOSS_STAGE3] */ 	/* 未定 */
// [1]
	{  0,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側1] */
	{ 51,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側2] */
	{102,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側3] */
	{153,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側4] */
	{  0, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側1] */
	{ 51, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側2] */
	{102, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側3] */
	{153, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側4] */
// [2]
	{  0,102, 50, 50},//	J,	/* ボス & 中-ボス[中心1] */
	{ 51,102, 50, 50},//	J,	/* ボス & 中-ボス[中心2] */
	{102,102, 50, 50},//	J,	/* ボス & 中-ボス[中心3] */
	{153,102, 50, 50},//	J,	/* ボス & 中-ボス[中心4] */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
// [3]
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{230,  0, 25, 25},//	J,	/* 妖精1 */
	{230,  0, 25, 25},//	J,	/* 妖精1 */
	{230,  0, 25, 25},//	J,	/* 妖精1 */
	{230,  0, 25, 25},//	J,	/* 妖精1 */
// [4]
	{230,  0, 25, 25},//	J,	/* 妖精1 */
	{230,  0, 25, 25},//	J,	/* 妖精1 */
	{230,  0, 25, 25},//	J,	/* 妖精1 */
	{230,  0, 25, 25},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 後ろの魔方陣 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [5]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
// [6]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
// [8]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{123, 10, 15, 15},//	J,	"Mitei Madakimattenai."

//	ステージ 3のボス(輝夜)
/* [OBJ_BANK_24_BOSS_STAGE4] */ 	/* 輝夜 */
// [1]
	{  0,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側1] */
	{ 51,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側2] */
	{102,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側3] */
	{153,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側4] */
	{  0, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側1] */
	{ 51, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側2] */
	{102, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側3] */
	{153, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側4] */
// [2]
	{  0,102, 50, 50},//	J,	/* ボス & 中-ボス[中心1] */
	{ 51,102, 50, 50},//	J,	/* ボス & 中-ボス[中心2] */
	{102,102, 50, 50},//	J,	/* ボス & 中-ボス[中心3] */
	{153,102, 50, 50},//	J,	/* ボス & 中-ボス[中心4] */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
// [3]
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{223,  0, 32, 37},//	J,	/* 妖精1 */
	{223, 38, 32, 33},//	J,	/* 妖精1 */
	{223, 72, 32, 36},//	J,	/* 妖精1 */
	{223,109, 32, 29},//	J,	/* 妖精1 */
// [4]
	{223,139, 32, 14},//	J,	/* 妖精1 */
	{223,  0, 32, 37},//	J,	/* 妖精1 */
	{223,  0, 32, 37},//	J,	/* 妖精1 */
	{223,  0, 32, 37},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 後ろの魔方陣 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [5]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
// [6]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
// [8]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{ 89, 10, 15, 15},//	J,	"Houraisan Kaguya."

//	ステージ 4のボス(文)
/* [OBJ_BANK_22_BOSS_STAGE2] */ 	/* 文 */
// [1]
	{  0,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側1] */
	{ 51,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側2] */
	{102,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側3] */
	{153,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側4] */
	{  0, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側1] */
	{ 51, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側2] */
	{102, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側3] */
	{153, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側4] */
// [2]
	{  0,102, 50, 50},//	J,	/* ボス & 中-ボス[中心1] */
	{ 51,102, 50, 50},//	J,	/* ボス & 中-ボス[中心2] */
	{102,102, 50, 50},//	J,	/* ボス & 中-ボス[中心3] */
	{153,102, 50, 50},//	J,	/* ボス & 中-ボス[中心4] */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
// [3]
	{204,  0, 50, 50},//	J,	/* 妖精1 */
	{204, 51, 50, 50},//	J,	/* 妖精1 */
	{204,102, 50, 50},//	J,	/* 妖精1 */
	{  8,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
// [4]
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 後ろの魔方陣 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [5]
	{  0,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛1 */
	{ 17,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛2 */
	{ 34,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛3 */
	{ 51,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛4 */
	{ 68,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛5 */
	{ 85,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛6 */
	{102,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛7 */
	{119,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛8 */
// [6]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
// [8]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{ 89, 10, 15, 15},//	J,	"Syameimaru Aya."

//	ステージ 5のボス(パチェ)
/* [OBJ_BANK_25_BOSS_STAGE5] */ 	/* パチェ */
// [1]
	{  0,  0, 28, 40},//	J,	/* ボス & 中-ボス[右側1] */
	{ 29,  0, 28, 40},//	J,	/* ボス & 中-ボス[右側2] */
	{ 58,  0, 28, 40},//	J,	/* ボス & 中-ボス[右側3] */
	{ 87,  0, 28, 40},//	J,	/* ボス & 中-ボス[右側4] */
	{  0, 41, 28, 40},//	J,	/* ボス & 中-ボス[左側1] */
	{ 29, 41, 28, 40},//	J,	/* ボス & 中-ボス[左側2] */
	{ 58, 41, 28, 40},//	J,	/* ボス & 中-ボス[左側3] */
	{ 87, 41, 28, 40},//	J,	/* ボス & 中-ボス[左側4] */
// [2]
	{  0, 82, 28, 40},//	J,	/* ボス & 中-ボス[中心1] */
	{ 29, 82, 28, 40},//	J,	/* ボス & 中-ボス[中心2] */
	{ 58, 82, 28, 40},//	J,	/* ボス & 中-ボス[中心3] */
	{ 87, 82, 28, 40},//	J,	/* ボス & 中-ボス[中心4] */
	{  0,  0,  8,  8},//	J,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	/* r29現在 未使用 */
// [3]
	{180,  0, 18, 24},//	J,	/* 妖精1[A] */
	{199,  0, 18, 24},//	J,	/* 妖精1[A] */
	{218,  0, 18, 24},//	J,	/* 妖精1[A] */
	{237,  0, 18, 24},//	J,	/* 妖精1[A] */
	{180, 25, 18, 24},//	J,	/* 妖精1[B] */
	{199, 25, 18, 24},//	J,	/* 妖精1[B] */
	{218, 25, 18, 24},//	J,	/* 妖精1[B] */
	{237, 25, 18, 24},//	J,	/* 妖精1[B] */
// [4]
	{180, 50, 18, 24},//	J,	/* 妖精1[C] */
	{199, 50, 18, 24},//	J,	/* 妖精1[C] */
	{218, 50, 18, 24},//	J,	/* 妖精1[C] */
	{237, 50, 18, 24},//	J,	/* 妖精1[C] */
	{180, 75, 18, 13},//	J,	/* 妖精1[D] */	/* 後ろの魔方陣 */
	{199, 75, 18, 13},//	J,	/* 妖精1[D] */
	{218, 75, 18, 13},//	J,	/* 妖精1[D] */
	{237, 75, 18, 13},//	J,	/* 妖精1[D] */
// [5]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
// [6]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
// [8]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{119, 10, 15, 15},//	J,	"Patchouli Knowledge."


//	ステージ 6のボス(咲夜)
/* [OBJ_BANK_26_BOSS_STAGE6] */ 	/* 咲夜 */
// [1]
	{  0,  0, 32, 46},//	J,	/* ボス & 中-ボス[右側1] */
	{ 33,  0, 32, 46},//	J,	/* ボス & 中-ボス[右側2] */
	{ 66,  0, 32, 46},//	J,	/* ボス & 中-ボス[右側3] */
	{ 99,  0, 32, 46},//	J,	/* ボス & 中-ボス[右側4] */
	{  0, 47, 32, 46},//	J,	/* ボス & 中-ボス[左側1] */
	{ 33, 47, 32, 46},//	J,	/* ボス & 中-ボス[左側2] */
	{ 66, 47, 32, 46},//	J,	/* ボス & 中-ボス[左側3] */
	{ 99, 47, 32, 46},//	J,	/* ボス & 中-ボス[左側4] */
// [2]
	{  0, 94, 32, 46},//	J,	/* ボス & 中-ボス[中心1] */
	{ 33, 94, 32, 46},//	J,	/* ボス & 中-ボス[中心2] */
	{ 66, 94, 32, 46},//	J,	/* ボス & 中-ボス[中心3] */
	{ 99, 94, 32, 46},//	J,	/* ボス & 中-ボス[中心4] */
	{  0,141, 32, 46},//	J,	/* r29現在 未使用 */
	{ 33,141, 32, 46},//	J,	/* r29現在 未使用 */
	{ 66,141, 32, 46},//	J,	/* r29現在 未使用 */
	{ 99,141, 32, 46},//	J,	/* r29現在 未使用 */
// [3]
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
// [4]
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{209,  0, 46, 46},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 後ろの魔方陣 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [5]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
// [6]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
// [8]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{ 83, 10, 15, 15},//	J,	"Izayoi Sakuya."


//	ステージ 1-6, extra, phantasm のザコ(r33現在、全部同じ大きさ)
/* [OBJ_BANK_27_BOSS_STAGE7_dummy] */	/* ダミー */
/* [OBJ_BANK_0a_TEKI_STAGE1] */
/* [OBJ_BANK_11_ZAKO_STAGE1] */ 		/* 雑魚 */
// [1]
	{  0,  0, 31, 35},//	J,	/* ボス & 中-ボス[右側1] */
	{ 32,  0, 31, 35},//	J,	/* ボス & 中-ボス[右側2] */
	{ 64,  0, 31, 35},//	J,	/* ボス & 中-ボス[右側3] */
	{ 96,  0, 31, 35},//	J,	/* ボス & 中-ボス[右側4] */
	{  0, 36, 31, 35},//	J,	/* ボス & 中-ボス[左側1] */
	{ 32, 36, 31, 35},//	J,	/* ボス & 中-ボス[左側2] */
	{ 64, 36, 31, 35},//	J,	/* ボス & 中-ボス[左側3] */
	{ 96, 36, 31, 35},//	J,	/* ボス & 中-ボス[左側4] */
// [2]
	{  0, 72, 31, 35},//	J,	/* ボス & 中-ボス[中心1] */
	{ 32, 72, 31, 35},//	J,	/* ボス & 中-ボス[中心2] */
	{ 64, 72, 31, 35},//	J,	/* ボス & 中-ボス[中心3] */
	{ 96, 72, 31, 35},//	J,	/* ボス & 中-ボス[中心4] */
	{  0,168, 32, 20},//	J,	,	/* r29現在 未使用 */
	{ 33,189, 32, 20},//	J,	,	/* r29現在 未使用 */
	{  0,168, 32, 20},//	J,	,	/* r29現在 未使用 */
	{ 33,189, 32, 20},//	J,	,	/* r29現在 未使用 */
// [3]
	{156,  0, 24, 24},//	J,	/* 妖精1 */
	{181,  0, 24, 24},//	J,	/* 妖精1 */
	{206,  0, 24, 24},//	J,	/* 妖精1 */
	{231,  0, 24, 24},//	J,	/* 妖精1 */
	{156, 25, 24, 24},//	J,	/* 妖精1 */
	{181, 25, 24, 24},//	J,	/* 妖精1 */
	{206, 25, 24, 24},//	J,	/* 妖精1 */
	{231, 25, 24, 24},//	J,	/* 妖精1 */
// [4]
	{156, 50, 24, 24},//	J,	/* 妖精1 */
	{181, 50, 24, 24},//	J,	/* 妖精1 */
	{206, 50, 24, 24},//	J,	/* 妖精1 */
	{231, 50, 24, 24},//	J,	/* 妖精1 */
	{109,168, 46, 46},//	J,	/* 後ろの魔方陣 */
	{ 66,168, 42, 42},//	J,
	{  0,211, 44, 44},//	J,
	{ 45,211, 44, 44},//	J,
// [5]
	{156, 75, 24, 24},//	J,	/* 妖精2 */
	{181, 75, 24, 24},//	J,	/* 妖精2 */
	{206, 75, 24, 24},//	J,	/* 妖精2 */
	{231, 75, 24, 24},//	J,	/* 妖精2 */
	{156,100, 24, 24},//	J,	/* 妖精2 */
	{181,100, 24, 24},//	J,	/* 妖精2 */
	{206,100, 24, 24},//	J,	/* 妖精2 */
	{231,100, 24, 24},//	J,	/* 妖精2 */
// [6]
	{156,125, 24, 24},//	J,	/* 妖精2 */
	{181,125, 24, 24},//	J,	/* 妖精2 */
	{206,125, 24, 24},//	J,	/* 妖精2 */
	{231,125, 24, 24},//	J,	/* 妖精2 */
	{ 90,215, 35, 40},//	J,
	{  0,108, 17, 19},//	J,
	{ 18,108, 17, 19},//	J,
	{126,231, 24, 24},//	J,
// [7]
	{156,150, 24, 24},//	J,	/* 妖精3 */
	{181,150, 24, 24},//	J,	/* 妖精3 */
	{206,150, 24, 24},//	J,	/* 妖精3 */
	{231,150, 24, 24},//	J,	/* 妖精3 */
	{156,175, 24, 24},//	J,	/* 妖精3 */
	{181,175, 24, 24},//	J,	/* 妖精3 */
	{206,175, 24, 24},//	J,	/* 妖精3 */
	{231,175, 24, 24},//	J,	/* 妖精3 */
// [8]
	{156,200, 24, 24},//	J,	/* 妖精3 */
	{181,200, 24, 24},//	J,	/* 妖精3 */
	{206,200, 24, 24},//	J,	/* 妖精3 */
	{231,200, 24, 24},//	J,	/* 妖精3 */
	{151,231, 24, 24},//	J,
	{176,231, 24, 24},//	J,
	{201,235, 20, 20},//	J,
	{222,235, 20, 20},//	J,

//	ステージ extra のボス(未定)
/* [OBJ_BANK_28_BOSS_STAGE8] */ 	/* チルノ？ */
// [1]
	{  0,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側1] */
	{ 51,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側2] */
	{102,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側3] */
	{153,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側4] */
	{  0, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側1] */
	{ 51, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側2] */
	{102, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側3] */
	{153, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側4] */
// [2]
	{  0,102, 50, 50},//	J,	/* ボス & 中-ボス[中心1] */
	{ 51,102, 50, 50},//	J,	/* ボス & 中-ボス[中心2] */
	{102,102, 50, 50},//	J,	/* ボス & 中-ボス[中心3] */
	{153,102, 50, 50},//	J,	/* ボス & 中-ボス[中心4] */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	,	/* r29現在 未使用 */
// [3]
	{204,  0, 50, 50},//	J,	/* 妖精1 */
	{204, 51, 50, 50},//	J,	/* 妖精1 */
	{204,102, 50, 50},//	J,	/* 妖精1 */
	{  8,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
// [4]
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 後ろの魔方陣 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [5]
	{  0,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛1 */
	{ 17,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛2 */
	{ 34,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛3 */
	{ 51,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛4 */
	{ 68,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛5 */
	{ 85,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛6 */
	{102,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛7 */
	{119,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛8 */
// [6]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
// [8]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{ 89, 10, 15, 15},//	J,	"Syameimaru Aya."

//	ステージ phantazm のボス(未定)
/* [OBJ_BANK_28_BOSS_STAGE8] */ 	/* チルノ？ */
// [1]
	{  0,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側1] */
	{ 51,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側2] */
	{102,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側3] */
	{153,  0, 50, 50},//	J,	/* ボス & 中-ボス[右側4] */
	{  0, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側1] */
	{ 51, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側2] */
	{102, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側3] */
	{153, 51, 50, 50},//	J,	/* ボス & 中-ボス[左側4] */
// [2]
	{  0,102, 50, 50},//	J,	/* ボス & 中-ボス[中心1] */
	{ 51,102, 50, 50},//	J,	/* ボス & 中-ボス[中心2] */
	{102,102, 50, 50},//	J,	/* ボス & 中-ボス[中心3] */
	{153,102, 50, 50},//	J,	/* ボス & 中-ボス[中心4] */
	{  0,  0,  8,  8},//	J,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	/* r29現在 未使用 */
	{  0,  0,  8,  8},//	J,	/* r29現在 未使用 */
// [3]
	{204,  0, 50, 50},//	J,	/* 妖精1 */
	{204, 51, 50, 50},//	J,	/* 妖精1 */
	{204,102, 50, 50},//	J,	/* 妖精1 */
	{  8,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
// [4]
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 妖精1 */
	{  0,  0,  8,  8},//	J,	/* 後ろの魔方陣 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [5]
	{  0,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛1 */
	{ 17,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛2 */
	{ 34,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛3 */
	{ 51,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛4 */
	{ 68,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛5 */
	{ 85,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛6 */
	{102,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛7 */
	{119,153, 16, 32},//	J,	/* 妖精2 */ 	/* 椛8 */
// [6]
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,	/* 妖精2 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
// [7]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
// [8]
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,	/* 妖精3 */
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{  0,  0,  8,  8},//	J,
	{ 89, 10, 15, 15},//	J,	"Syameimaru Aya."



//-----------------------------------------------------------------------
//-----------------------------------------------------------------------

/* --- 敵面 --- */
//
/* [OBJ_BANK_11_ZAKO_STAGE1] */
/* [OBJ_BANK_12_ZAKO_STAGE2] */
/* [OBJ_BANK_13_ZAKO_STAGE3] */
/* [OBJ_BANK_14_ZAKO_STAGE4] */
/* [OBJ_BANK_15_ZAKO_STAGE5] */
/* [OBJ_BANK_16_ZAKO_STAGE6] */
/* [OBJ_BANK_17_ZAKO_STAGE7_dummy] */
/* [OBJ_BANK_18_ZAKO_STAGE8] */

/* [OBJ_BANK_0a_TEKI_STAGE1] */ 	/*	*/
/* [OBJ_BANK_0b_TEKI_STAGE2] */
/* [OBJ_BANK_0c_TEKI_STAGE3] */
/* [OBJ_BANK_0d_TEKI_STAGE4] */
/* [OBJ_BANK_0e_TEKI_STAGE5] */
/* [OBJ_BANK_0f_TEKI_STAGE6] */
/* [OBJ_BANK_10_TEKI_STAGE7_dummy] */
/* [OBJ_BANK_11_TEKI_STAGE8] */

};

