
/*---------------------------------------------------------
	東方模倣風 ～ Toho Imitation Style.
	http://code.google.com/p/kene-touhou-mohofu/
	-------------------------------------------------------
	道中のザコ
	-------------------------------------------------------
		"緑毛玉2",		"CRUSHER",
	-------------------------------------------------------
	緑毛玉	横一列に並んで、上から突っ込んでくる。
---------------------------------------------------------*/

/*---------------------------------------------------------
	敵移動
---------------------------------------------------------*/

static void move_midori_kedama2(OBJ *src)
{
	if (0 < src->kaisu_nnn)
	{
		if (0 == src->wait1)
		{
		//	src->cy256 += (t256(3.00)+t256(teki_rank)); 		/*fps_factor*/ /* はやすぎ */
			src->cy256 += (t256(1.5));		/*fps_factor*/
		//	if (src->cy256 > (signed)(((cg_game_di fficulty)<<5) + t256(64)) )		/* 下限  t256(160) t256(200) */
		//	if (src->cy256 > (signed)(((3)<<5) + t256(64)) )		/* 下限  t256(160) t256(200) */
		//	if (src->cy256 > (signed)(((3)*32) + t256(64)) )		/* 下限  t256(160) t256(200) */
		//	if (src->cy256 > (signed)((96) + t256(64)) )		/* 下限  t256(160) t256(200) */
		//	if (src->cy256 > (signed)( t256(66.6666)) ) 	/* 下限  t256(160) t256(200) */
			if (src->cy256 >  (t256(64)) )		/* 下限  t256(160) t256(200) */
			{
				src->wait1		= 1;
				src->kaisu_nnn -= 1;
			}
		}
		else
		{
		//	src->cy256 -= (t256(2.00)+t256(teki_rank)); 		/*fps_factor*/ /* はやすぎ */
			src->cy256 -= (t256(0.75)); 	/*fps_factor*/
			if (src->cy256 < t256(32))						/* 上限  t256(50) */
			{
				src->wait1 = 0;
			}
		}
	//	if (/*0 <*/ teki_rank)	/* easyは速いんだから場合分けしない */
		{
			/*
			0  0/100   0/65536
			1  1/90  728/65536
			2  1/80  819/65536
			3  1/70  936/65536
			*/
		//	static const u16 kakuritu_tbl[4] =
		//	{ 0, 728, 819, 936 };
		//	if (0==(ra_nd()%(100-teki_rank*10)))
		//	if (kakuritu_tbl[3/*teki_rank*/] > (ra_nd()&(65536-1)))
			if (936 > (ra_nd()&(65536-1)))
			{
				zako_shot_supeka(src, ZAKO_SPEKA_19_midori2);
			}
		}
	}
	else
	{
	//	src->cy256 -= t256(4);/* はやすぎ */
		src->cy256 -= t256(1.5);
		gamen_gai_nara_zako_osimai(src);/* 画面外ならおしまい */
	}
	/* アニメーション */
	src->zako_anime_rotate_angle1024 = ( 10);
	zako_anime_type04(src); 	/* グラ回転 */
}

/*---------------------------------------------------------
	敵を追加する
---------------------------------------------------------*/

static void regist_zako_009_midori_kedama2(GAME_COMMAND *l, OBJ *h)
{
	h->wait1				= 0;
	h->kaisu_nnn			= (5);/*2*/
}
