
static VIRTUAL_OBJ_STATE obj_status_table[(OBJ_BANK_MAX*OBJ_BANK_SIZE)/*(6*8*8)*/] =
{
/* [OBJ_BANK_00_TAMA] */
//1
	{  0, 9, 10,10},// BULLET_00_HOSI_TEN,
	{ 64, 9,  7,10},// BULLET_KOME_01_AOI,
	{ 72, 9,  7,10},// BULLET_KOME_02_AKA,
	{ 80, 9,  7,10},// BULLET_KOME_03_YUKARI,
	{ 88, 9,  7,10},// BULLET_KOME_04_MIDORI,
	{ 96, 9,  7,10},// BULLET_KOME_05_KIIRO,
	{104, 9,  7,10},// BULLET_KOME_06_dummy,
	{112, 9,  7,10},// BULLET_KOME_07_dummy,
//2
	{  0, 0,  8, 8},// BULLET_MARU8_00_AKA
	{  9, 0,  8, 8},// BULLET_MARU8_01_YUKARI,
	{ 18, 0,  8, 8},// BULLET_MARU8_02_AOI,
	{ 27, 0,  8, 8},// BULLET_MARU8_03_MIDORI,
	{ 36, 0,  8, 8},// BULLET_MARU8_04_MIDORI,
	{ 45, 0,  8, 8},// BULLET_MARU8_05_MIDORI,
	{ 54, 0,  8, 8},// BULLET_MARU8_06_KIIRO,
	{ 63, 0,  8, 8},// BULLET_MARU8_07_AOI,
//3
	{ 72, 0,  8, 8},// BULLET_MARU8_08_dummy,
	{ 81, 0,  8, 8},// BULLET_MARU8_09_dummy,
	{ 90, 0,  8, 8},// BULLET_MARU8_10_dummy,
	{ 99, 0,  8, 8},// BULLET_MARU8_11_dummy,
	{108, 0,  8, 8},// BULLET_MARU8_12_dummy,
	{117, 0,  8, 8},// BULLET_MARU8_13_dummy,
	{104,48,  7,14},// BULLET_CAP16_04_SIROI
	{112,48,  7,14},// BULLET_CAP16_05_SIROI
//4
	{ 11, 9, 10,10},// BULLET_MARU10_00_AOI,
	{ 22, 9, 10,10},// BULLET_MARU10_01_MIDORI,
	{ 33, 9, 10,10},// BULLET_MARU10_02_MIDORI,
	{ 44, 9, 10,10},// BULLET_MARU10_03_MIDORI,
	{  0,20, 12,12},// BULLET_MARU12_00_SIRO,
	{ 13,20, 12,12},// BULLET_MARU12_01_AKA,
	{ 26,20, 12,12},// BULLET_MARU12_02_MIDORI,
	{ 39,20, 12,12},// BULLET_MARU12_03_AOI,
//5
	{  0,33, 15,14},// BULLET_UROKO14_00_AOI,
	{ 16,33, 15,14},// BULLET_UROKO14_01_AKA,
	{ 32,33, 15,14},// BULLET_UROKO14_02_YUKARI,
	{ 48,33, 15,14},// BULLET_UROKO14_03_MIDORI,
	{ 64,33, 15,14},// BULLET_UROKO14_04_MIZUIRO,
	{ 80,33, 15,14},// BULLET_UROKO14_05_KIIRO,
	{ 96,33, 15,14},// BULLET_UROKO14_06_dummy,
	{112,33, 15,14},// BULLET_UROKO14_07_dummy,
//6
	{  0,48,  7,15},// BULLET_KUNAI12_00_AOI
	{  8,48,  7,15},// BULLET_KUNAI12_01_AKA,
	{ 16,48,  7,15},// BULLET_KUNAI12_02_MIDORI
	{ 24,48,  7,15},// BULLET_KUNAI12_03_MIDORI,
	{ 32,48,  7,15},// BULLET_KUNAI12_04_YUKARI,
	{ 40,48,  7,15},// BULLET_KUNAI12_05_AOI,
	{ 48,48,  7,15},// BULLET_KUNAI12_06_KIN,
	{ 56,48,  7,15},// BULLET_KUNAI12_07_KIN,
//7
	{ 64,48,  9,14},// BULLET_OFUDA12_00_AOI,
	{ 74,48,  9,14},// BULLET_OFUDA12_01_AKA,
	{ 84,48,  9,14},// BULLET_OFUDA12_02_YUKARI,
	{ 94,48,  9,14},// BULLET_OFUDA12_03_MIDORI,
	{ 64,64,  9,21},// BULLET_KNIFE20_04_AOI,
	{ 74,64,  9,21},// BULLET_KNIFE20_05_AKA,
	{ 84,64,  9,21},// BULLET_KNIFE20_06_YUKARI,
	{ 94,64,  9,21},// BULLET_KNIFE20_07_MIDORI,
//8
	{  0,64,  5,32},// BULLET_HARI32_00_AOI
	{  6,64,  5,32},// BULLET_HARI32_01_AKA
	{ 12,64,  5,32},// BULLET_HARI32_02_KIIRO
	{ 18,64,  5,32},// BULLET_HARI32_03_DAIDAI
	{  0,96, 31,31},// BULLET_OODAMA32_00_SIROI,
	{ 32,96, 31,31},// BULLET_OODAMA32_01_AOI,
	{ 64,96, 31,31},// BULLET_OODAMA32_02_AKA,
	{ 96,96, 31,31},// BULLET_OODAMA32_03_YUKARI,
//
/* [OBJ_BANK_01_REIMU_A] */
//[00霊夢A]
//						//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]					//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= SP_GROUP_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */
// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_01,		/* レーザー2 */
	{  1, 64, 32, 32},//	JIKI_ETC_02,		/* レーザー3 */
	{  1, 64, 32, 32},//	JIKI_ETC_03,		/* レーザー4 */
// [3]
	{  1, 64, 32, 32},//	JIKI_BOMBER_00, 	/* レーザー5 */
	{  1, 64, 32, 32},//	JIKI_BOMBER_01, 	/* レーザー6 */
	{222,  0, 32, 32},//	JIKI_BOMBER_02, 	/* 星1 / 蝶1 / 十字炎1 */
	{222, 32, 32, 32},//	JIKI_BOMBER_03, 	/* 星2 / 蝶2 / 十字炎2 */
	{222, 64, 32, 32},//	JIKI_BOMBER_04, 	/* 星3 / 蝶3 / 十字炎3 */
	{222, 96, 32, 32},//	JIKI_BOMBER_05, 	/* 星4 / 蝶4 / 十字炎4 */
	{  0,128,127,127},//	JIKI_BOMBER_06, 	/* 星5 / 蝶5 / 長炎1 / 結界白 */
	{128,128,127,127},//	JIKI_BOMBER_07, 	/* 星6 / 蝶6 / 長炎2 / 結界黄  */
// [4]
	{222, 96, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 / 赤札C */
	{222, 96, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 / 赤札B(霊夢の回転ショット) */
	{128,  0, 10, 36},//	JIKI_SHOT_02,		/* 赤札A / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{139,  0,  5, 32},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */
// [5]
	{  0, 96, 18, 18},//	JIKI_OPTION_00_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_07,
// [6]
	{  0, 96, 18, 18},//	JIKI_OPTION_01_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_07,
// [7]
	{  0, 96, 18, 18},//	JIKI_OPTION_02_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_07,
// [8]
	{  0, 96, 18, 18},//	JIKI_OPTION_03_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_07,

//
/* [OBJ_BANK_02_REIMU_B] */
//[00霊夢B]
//						//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]					//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= SP_GROUP_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */
// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_01,		/* レーザー2 */
	{  1, 64, 32, 32},//	JIKI_ETC_02,		/* レーザー3 */
	{  1, 64, 32, 32},//	JIKI_ETC_03,		/* レーザー4 */
// [3]
	{  1, 64, 32, 32},//	JIKI_BOMBER_00, 	/* レーザー5 */
	{  1, 64, 32, 32},//	JIKI_BOMBER_01, 	/* レーザー6 */
	{222,  0, 32, 32},//	JIKI_BOMBER_02, 	/* 星1 / 蝶1 / 十字炎1 */
	{222, 32, 32, 32},//	JIKI_BOMBER_03, 	/* 星2 / 蝶2 / 十字炎2 */
	{222, 64, 32, 32},//	JIKI_BOMBER_04, 	/* 星3 / 蝶3 / 十字炎3 */
	{222, 96, 32, 32},//	JIKI_BOMBER_05, 	/* 星4 / 蝶4 / 十字炎4 */
	{  0,128,127,127},//	JIKI_BOMBER_06, 	/* 星5 / 蝶5 / 長炎1 / 結界白 */
	{128,128,127,127},//	JIKI_BOMBER_07, 	/* 星6 / 蝶6 / 長炎2 / 結界黄  */
// [4]
	{222, 96, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 / 赤札C */
	{222, 96, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 / 赤札B(霊夢の回転ショット) */
	{128,  0, 10, 36},//	JIKI_SHOT_02,		/* 赤札A / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{139,  0,  5, 32},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */
// [5]
	{  0, 96, 18, 18},//	JIKI_OPTION_00_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_07,
// [6]
	{  0, 96, 18, 18},//	JIKI_OPTION_01_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_07,
// [7]
	{  0, 96, 18, 18},//	JIKI_OPTION_02_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_07,
// [8]
	{  0, 96, 18, 18},//	JIKI_OPTION_03_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_07,

//
/* [OBJ_BANK_03_MARISA_A] */
// [01魔理沙_A]
//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= SP_GROUP_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */
// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_01,		/* レーザー2 */
	{  1, 64, 32, 32},//	JIKI_ETC_02,		/* レーザー3 */
	{  1, 64, 32, 32},//	JIKI_ETC_03,		/* レーザー4 */
// [3]
	{  1, 64, 32, 32},//	JIKI_BOMBER_00, 	/* レーザー5 */
	{  1, 64, 32, 32},//	JIKI_BOMBER_01, 	/* レーザー6 */
	{169,  0, 86, 81},//	JIKI_BOMBER_02, 	/* 星1 / 蝶1 / 十字炎1 */
	{169, 82, 86, 81},//	JIKI_BOMBER_03, 	/* 星2 / 蝶2 / 十字炎2 */
	{169,164, 86, 81},//	JIKI_BOMBER_04, 	/* 星3 / 蝶3 / 十字炎3 */
	{169,  0, 86, 81},//	JIKI_BOMBER_05, 	/* 星4 / 蝶4 / 十字炎4 */
	{169, 82, 86, 81},//	JIKI_BOMBER_06, 	/* 星5 / 蝶5 / 長炎1 / 結界白 */
	{169,164, 86, 81},//	JIKI_BOMBER_07, 	/* 星6 / 蝶6 / 長炎2 / 結界黄  */
// [4]
	{  1, 64, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{128,  0, 10, 32},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{139,  0, 15, 18},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */
// [5]
	{  0,120,  9,  9},//	JIKI_OPTION_00_00,
	{  0,120,  9,  9},//	JIKI_OPTION_00_01,
	{  0,120,  9,  9},//	JIKI_OPTION_00_02,
	{  0,120,  9,  9},//	JIKI_OPTION_00_03,
	{  0,120,  9,  9},//	JIKI_OPTION_00_04,
	{  0,120,  9,  9},//	JIKI_OPTION_00_05,
	{  0,120,  9,  9},//	JIKI_OPTION_00_06,
	{  0,120,  9,  9},//	JIKI_OPTION_00_07,
// [6]
	{  0,120,  9,  9},//	JIKI_OPTION_01_00,
	{  0,120,  9,  9},//	JIKI_OPTION_01_01,
	{  0,120,  9,  9},//	JIKI_OPTION_01_02,
	{  0,120,  9,  9},//	JIKI_OPTION_01_03,
	{  0,120,  9,  9},//	JIKI_OPTION_01_04,
	{  0,120,  9,  9},//	JIKI_OPTION_01_05,
	{  0,120,  9,  9},//	JIKI_OPTION_01_06,
	{  0,120,  9,  9},//	JIKI_OPTION_01_07,
// [7]
	{  0,120,  9,  9},//	JIKI_OPTION_02_00,
	{  0,120,  9,  9},//	JIKI_OPTION_02_01,
	{  0,120,  9,  9},//	JIKI_OPTION_02_02,
	{  0,120,  9,  9},//	JIKI_OPTION_02_03,
	{  0,120,  9,  9},//	JIKI_OPTION_02_04,
	{  0,120,  9,  9},//	JIKI_OPTION_02_05,
	{  0,120,  9,  9},//	JIKI_OPTION_02_06,
	{  0,120,  9,  9},//	JIKI_OPTION_02_07,
// [8]
	{  0,120,  9,  9},//	JIKI_OPTION_03_00,
	{  0,120,  9,  9},//	JIKI_OPTION_03_01,
	{  0,120,  9,  9},//	JIKI_OPTION_03_02,
	{  0,120,  9,  9},//	JIKI_OPTION_03_03,
	{  0,120,  9,  9},//	JIKI_OPTION_03_04,
	{  0,120,  9,  9},//	JIKI_OPTION_03_05,
	{  0,120,  9,  9},//	JIKI_OPTION_03_06,
	{  0,120,  9,  9},//	JIKI_OPTION_03_07,


//
/* [OBJ_BANK_04_MARISA_B] */
// [01魔理沙_B]
//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= SP_GROUP_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */
// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_01,		/* レーザー2 */
	{  1, 64, 32, 32},//	JIKI_ETC_02,		/* レーザー3 */
	{  1, 64, 32, 32},//	JIKI_ETC_03,		/* レーザー4 */
// [3]
	{  1, 64, 32, 32},//	JIKI_BOMBER_00, 	/* レーザー5 */
	{  1, 64, 32, 32},//	JIKI_BOMBER_01, 	/* レーザー6 */
	{169,  0, 86, 81},//	JIKI_BOMBER_02, 	/* 星1 / 蝶1 / 十字炎1 */
	{169, 82, 86, 81},//	JIKI_BOMBER_03, 	/* 星2 / 蝶2 / 十字炎2 */
	{169,164, 86, 81},//	JIKI_BOMBER_04, 	/* 星3 / 蝶3 / 十字炎3 */
	{169,  0, 86, 81},//	JIKI_BOMBER_05, 	/* 星4 / 蝶4 / 十字炎4 */
	{169, 82, 86, 81},//	JIKI_BOMBER_06, 	/* 星5 / 蝶5 / 長炎1 / 結界白 */
	{169,164, 86, 81},//	JIKI_BOMBER_07, 	/* 星6 / 蝶6 / 長炎2 / 結界黄  */
// [4]
	{  1, 64, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{128,  0, 10, 32},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{139,  0, 15, 18},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */
// [5]
	{  0,120,  9,  9},//	JIKI_OPTION_00_00,
	{  0,120,  9,  9},//	JIKI_OPTION_00_01,
	{  0,120,  9,  9},//	JIKI_OPTION_00_02,
	{  0,120,  9,  9},//	JIKI_OPTION_00_03,
	{  0,120,  9,  9},//	JIKI_OPTION_00_04,
	{  0,120,  9,  9},//	JIKI_OPTION_00_05,
	{  0,120,  9,  9},//	JIKI_OPTION_00_06,
	{  0,120,  9,  9},//	JIKI_OPTION_00_07,
// [6]
	{  0,120,  9,  9},//	JIKI_OPTION_01_00,
	{  0,120,  9,  9},//	JIKI_OPTION_01_01,
	{  0,120,  9,  9},//	JIKI_OPTION_01_02,
	{  0,120,  9,  9},//	JIKI_OPTION_01_03,
	{  0,120,  9,  9},//	JIKI_OPTION_01_04,
	{  0,120,  9,  9},//	JIKI_OPTION_01_05,
	{  0,120,  9,  9},//	JIKI_OPTION_01_06,
	{  0,120,  9,  9},//	JIKI_OPTION_01_07,
// [7]
	{  0,120,  9,  9},//	JIKI_OPTION_02_00,
	{  0,120,  9,  9},//	JIKI_OPTION_02_01,
	{  0,120,  9,  9},//	JIKI_OPTION_02_02,
	{  0,120,  9,  9},//	JIKI_OPTION_02_03,
	{  0,120,  9,  9},//	JIKI_OPTION_02_04,
	{  0,120,  9,  9},//	JIKI_OPTION_02_05,
	{  0,120,  9,  9},//	JIKI_OPTION_02_06,
	{  0,120,  9,  9},//	JIKI_OPTION_02_07,
// [8]
	{  0,120,  9,  9},//	JIKI_OPTION_03_00,
	{  0,120,  9,  9},//	JIKI_OPTION_03_01,
	{  0,120,  9,  9},//	JIKI_OPTION_03_02,
	{  0,120,  9,  9},//	JIKI_OPTION_03_03,
	{  0,120,  9,  9},//	JIKI_OPTION_03_04,
	{  0,120,  9,  9},//	JIKI_OPTION_03_05,
	{  0,120,  9,  9},//	JIKI_OPTION_03_06,
	{  0,120,  9,  9},//	JIKI_OPTION_03_07,


//
/* [OBJ_BANK_05_REMILIA] */
// [04レミリア]
//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= SP_GROUP_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 32, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */
// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_01,		/* レーザー2 */
	{  1, 64, 32, 32},//	JIKI_ETC_02,		/* レーザー3 */
	{  1, 64, 32, 32},//	JIKI_ETC_03,		/* レーザー4 */
// [3]
	{  1, 64, 32, 32},//	JIKI_BOMBER_00, 	/* レーザー5 */
	{  1, 64, 32, 32},//	JIKI_BOMBER_01, 	/* レーザー6 */
	{ 16,128,  4, 16},//	JIKI_BOMBER_02, 	/* 星1 / 蝶1 / 歪炎A1 / 十字炎1 */
	{ 32,128,  4, 16},//	JIKI_BOMBER_03, 	/* 星2 / 蝶2 / 歪炎A2 / 十字炎2 */
	{ 48,128,  4, 16},//	JIKI_BOMBER_04, 	/* 星3 / 蝶3 / 歪炎A3 / 十字炎3 */
	{ 64,128,  4, 16},//	JIKI_BOMBER_05, 	/* 星4 / 蝶4 / 歪炎A4 / 十字炎4 */
	{ 80,128,  4, 16},//	JIKI_BOMBER_06, 	/* 星5 / 蝶5 / 歪炎B1 / 長炎1 / 結界白 */
	{ 96,128,  4, 16},//	JIKI_BOMBER_07, 	/* 星6 / 蝶6 / 歪炎B2 / 長炎2 / 結界黄	*/
// [4]
	{ 96,128,  4, 16},//	JIKI_SHOT_00,		/* 歪炎B3 / 長炎3 */
	{112,128,  4, 16},//	JIKI_SHOT_01,		/* 歪炎B4 / 長炎4 */
	{128,  0,  6, 26},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{135,  0, 14, 10},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{150,  0, 14, 10},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{165,  0, 14, 10},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{180,  0, 14, 10},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{135,  0, 14, 10},//	JIKI_SHOT_07,		/* 195 こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */
// [5]
	{  0, 96, 18, 18},//	JIKI_OPTION_00_00,/*{	0, 99, 13, 13}, */
	{  0, 96, 18, 18},//	JIKI_OPTION_00_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_00_07,
// [6]
	{  0, 96, 18, 18},//	JIKI_OPTION_01_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_01_07,
// [7]
	{  0, 96, 18, 18},//	JIKI_OPTION_02_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_02_07,
// [8]
	{  0, 96, 18, 18},//	JIKI_OPTION_03_00,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_01,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_02,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_03,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_04,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_05,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_06,
	{  0, 96, 18, 18},//	JIKI_OPTION_03_07,

//
/* [OBJ_BANK_05_YUYUKO] */
// [05幽々子]
//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= SP_GROUP_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */
// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_01,		/* レーザー2 */
	{  1, 64, 32, 32},//	JIKI_ETC_02,		/* レーザー3 */
	{  1, 64, 32, 32},//	JIKI_ETC_03,		/* レーザー4 */
// [3]
	{  1, 64, 32, 32},//	JIKI_BOMBER_00, 	/* レーザー5 */
	{  1, 64, 32, 32},//	JIKI_BOMBER_01, 	/* レーザー6 */
	{168,  0, 46, 37},//	JIKI_BOMBER_02, 	/* 星1 / 蝶1 / 十字炎1 */
	{168, 40, 46, 37},//	JIKI_BOMBER_03, 	/* 星2 / 蝶2 / 十字炎2 */
	{168,  0, 46, 37},//	JIKI_BOMBER_04, 	/* 星3 / 蝶3 / 十字炎3 */
	{168, 40, 46, 37},//	JIKI_BOMBER_05, 	/* 星4 / 蝶4 / 十字炎4 */
	{168,  0, 46, 37},//	JIKI_BOMBER_06, 	/* 星5 / 蝶5 / 長炎1 / 結界白 */
	{168, 40, 46, 37},//	JIKI_BOMBER_07, 	/* 星6 / 蝶6 / 長炎2 / 結界黄  */
// [4]
	{  0,151,197,104},//	JIKI_SHOT_00,		/* 長炎3 / [幽々子ボムの扇本体] */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{128,  0, 18, 31},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{147,  0, 20, 38},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */
// [5]
	{  0,112, 15, 15},//	JIKI_OPTION_00_00,
	{ 16,112, 15, 15},//	JIKI_OPTION_00_01,
	{ 32,112, 15, 15},//	JIKI_OPTION_00_02,
	{ 48,112, 15, 15},//	JIKI_OPTION_00_03,
	{ 64,112, 15, 15},//	JIKI_OPTION_00_04,
	{ 80,112, 15, 15},//	JIKI_OPTION_00_05,
	{ 96,112, 15, 15},//	JIKI_OPTION_00_06,
	{112,112, 15, 15},//	JIKI_OPTION_00_07,
// [6]
	{  0,112, 15, 15},//	JIKI_OPTION_01_00,
	{  0,112, 15, 15},//	JIKI_OPTION_01_01,
	{  0,112, 15, 15},//	JIKI_OPTION_01_02,
	{  0,112, 15, 15},//	JIKI_OPTION_01_03,
	{  0,112, 15, 15},//	JIKI_OPTION_01_04,
	{  0,112, 15, 15},//	JIKI_OPTION_01_05,
	{  0,112, 15, 15},//	JIKI_OPTION_01_06,
	{  0,112, 15, 15},//	JIKI_OPTION_01_07,
// [7]
	{  0,112, 15, 15},//	JIKI_OPTION_02_00,
	{  0,112, 15, 15},//	JIKI_OPTION_02_01,
	{  0,112, 15, 15},//	JIKI_OPTION_02_02,
	{  0,112, 15, 15},//	JIKI_OPTION_02_03,
	{  0,112, 15, 15},//	JIKI_OPTION_02_04,
	{  0,112, 15, 15},//	JIKI_OPTION_02_05,
	{  0,112, 15, 15},//	JIKI_OPTION_02_06,
	{  0,112, 15, 15},//	JIKI_OPTION_02_07,
// [8]
	{  0,112, 15, 15},//	JIKI_OPTION_03_00,
	{  0,112, 15, 15},//	JIKI_OPTION_03_01,
	{  0,112, 15, 15},//	JIKI_OPTION_03_02,
	{  0,112, 15, 15},//	JIKI_OPTION_03_03,
	{  0,112, 15, 15},//	JIKI_OPTION_03_04,
	{  0,112, 15, 15},//	JIKI_OPTION_03_05,
	{  0,112, 15, 15},//	JIKI_OPTION_03_06,
	{  0,112, 15, 15},//	JIKI_OPTION_03_07,

//
/* [OBJ_BANK_06_CIRNO_A] */
// [06チルノA]
//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= SP_GROUP_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */
// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_01,		/* レーザー2 */
	{  1, 64, 32, 32},//	JIKI_ETC_02,		/* レーザー3 */
	{  1, 64, 32, 32},//	JIKI_ETC_03,		/* レーザー4 */
// [3]
	{  1, 64, 32, 32},//	JIKI_BOMBER_00, 	/* レーザー5 */
	{  1, 64, 32, 32},//	JIKI_BOMBER_01, 	/* レーザー6 */
	{169,  0, 86, 85},//	JIKI_BOMBER_02, 	/* 星1 / 蝶1 / 十字炎1 */
	{169, 86, 86, 84},//	JIKI_BOMBER_03, 	/* 星2 / 蝶2 / 十字炎2 */
	{169,171, 86, 84},//	JIKI_BOMBER_04, 	/* 星3 / 蝶3 / 十字炎3 */
	{169,  0, 86, 85},//	JIKI_BOMBER_05, 	/* 星4 / 蝶4 / 十字炎4 */
	{169, 86, 86, 84},//	JIKI_BOMBER_06, 	/* 星5 / 蝶5 / 長炎1 / 結界白 */
	{169,171, 86, 84},//	JIKI_BOMBER_07, 	/* 星6 / 蝶6 / 長炎2 / 結界黄  */
// [4]
	{  1, 64, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{128,  0,  9, 34},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{138,  0, 15, 14},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */
// [5]
	{  0,128, 16, 15},//	JIKI_OPTION_00_00,
	{ 16,128, 16, 15},//	JIKI_OPTION_00_01,
	{ 32,128, 16, 15},//	JIKI_OPTION_00_02,
	{ 48,128, 16, 15},//	JIKI_OPTION_00_03,
	{ 64,128, 16, 15},//	JIKI_OPTION_00_04,
	{ 80,128, 16, 15},//	JIKI_OPTION_00_05,
	{ 96,128, 16, 15},//	JIKI_OPTION_00_06,
	{112,128, 16, 15},//	JIKI_OPTION_00_07,
// [6]
	{  0,144, 16, 15},//	JIKI_OPTION_01_00,
	{ 16,144, 16, 15},//	JIKI_OPTION_01_01,
	{ 32,144, 16, 15},//	JIKI_OPTION_01_02,
	{ 48,144, 16, 15},//	JIKI_OPTION_01_03,
	{ 64,144, 16, 15},//	JIKI_OPTION_01_04,
	{ 80,144, 16, 15},//	JIKI_OPTION_01_05,
	{ 96,144, 16, 15},//	JIKI_OPTION_01_06,
	{112,144, 16, 15},//	JIKI_OPTION_01_07,
// [7]
	{  0,160, 16, 15},//	JIKI_OPTION_02_00,
	{ 16,160, 16, 15},//	JIKI_OPTION_02_01,
	{ 32,160, 16, 15},//	JIKI_OPTION_02_02,
	{ 48,160, 16, 15},//	JIKI_OPTION_02_03,
	{ 64,160, 16, 15},//	JIKI_OPTION_02_04,
	{ 80,160, 16, 15},//	JIKI_OPTION_02_05,
	{ 96,160, 16, 15},//	JIKI_OPTION_02_06,
	{112,160, 16, 15},//	JIKI_OPTION_02_07,
// [8]
	{  0,176, 16, 15},//	JIKI_OPTION_03_00,
	{ 16,176, 16, 15},//	JIKI_OPTION_03_01,
	{ 32,176, 16, 15},//	JIKI_OPTION_03_02,
	{ 48,176, 16, 15},//	JIKI_OPTION_03_03,
	{ 64,176, 16, 15},//	JIKI_OPTION_03_04,
	{ 80,176, 16, 15},//	JIKI_OPTION_03_05,
	{ 96,176, 16, 15},//	JIKI_OPTION_03_06,
	{112,176, 16, 15},//	JIKI_OPTION_03_07,

//
/* [OBJ_BANK_07_CIRNO_Q] */
// [07チルノ Q]
//					//	左へ移動のアニメーション	[中心→左側4→左側3→左側2→左側1→左側1→左側1→...]
// [1]				//	JIKI_PLAYER_00_LEFT 	/* 左側1 */ 	/* 最も左 */			= SP_GROUP_JIKI_GET_ITEM/*0x08
	{  0,  0, 31, 31},//	JIKI_PLAYER_01_LEFT,	/* 左側2 */
	{ 32,  0, 31, 31},//	JIKI_PLAYER_02_LEFT,	/* 左側3 */
	{ 64,  0, 31, 31},//	JIKI_PLAYER_03_LEFT,	/* 左側4 */ 	/* 中より左 */
	{ 96,  0, 31, 31},//	繰り返しアニメーション		[中心1→中心2→中心3→中心4→中心1→中心2→中心3→中心4→...]
	{  0, 32, 31, 31},//	JIKI_PLAYER_04_MID, 	/* 中心1 */
	{ 32, 32, 31, 31},//	JIKI_PLAYER_05_MID, 	/* 中心2 */
	{ 64, 32, 31, 31},//	JIKI_PLAYER_06_MID, 	/* 中心3 */
	{ 96, 32, 31, 31},//	JIKI_PLAYER_07_MID, 	/* 中心4 */
// [2]				//	右へ移動のアニメーション	[中心→右側1→右側2→右側3→右側4→右側4→右側4→...]
	{  0, 64, 31, 31},//	JIKI_PLAYER_08_RIGHT,	/* 右側1 */ 	/* 中より右 */
	{ 32, 64, 31, 31},//	JIKI_PLAYER_09_RIGHT,	/* 右側2 */
	{ 64, 64, 31, 31},//	JIKI_PLAYER_10_RIGHT,	/* 右側3 */
	{ 96, 64, 31, 31},//	JIKI_PLAYER_11_RIGHT,	/* 右側4 */ 	/* 最も右 */	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_00,		/* レーザー1 */
	{  1, 64, 32, 32},//	JIKI_ETC_01,		/* レーザー2 */
	{  1, 64, 32, 32},//	JIKI_ETC_02,		/* レーザー3 */
	{  1, 64, 32, 32},//	JIKI_ETC_03,		/* レーザー4 */
// [3]
	{  1, 64, 32, 32},//	JIKI_BOMBER_00, 	/* レーザー5 */
	{  1, 64, 32, 32},//	JIKI_BOMBER_01, 	/* レーザー6 */
	{169,  0, 86, 85},//	JIKI_BOMBER_02, 	/* 星1 / 蝶1 / 十字炎1 */
	{169, 86, 86, 84},//	JIKI_BOMBER_03, 	/* 星2 / 蝶2 / 十字炎2 */
	{169,171, 86, 84},//	JIKI_BOMBER_04, 	/* 星3 / 蝶3 / 十字炎3 */
	{169,  0, 86, 85},//	JIKI_BOMBER_05, 	/* 星4 / 蝶4 / 十字炎4 */
	{169, 86, 86, 84},//	JIKI_BOMBER_06, 	/* 星5 / 蝶5 / 長炎1 / 結界白 */
	{169,171, 86, 84},//	JIKI_BOMBER_07, 	/* 星6 / 蝶6 / 長炎2 / 結界黄  */
// [4]
	{  1, 64, 32, 32},//	JIKI_SHOT_00,		/* 長炎3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_01,		/* 長炎4 */
	{128,  0,  9, 34},//	JIKI_SHOT_02,		/* 赤札 / 黄星 / 小炎 / 氷 / 青蝶 */
	{  1, 64, 32, 32},//	JIKI_SHOT_03,		/* こうもり弾1 / 黄札1 */
	{  1, 64, 32, 32},//	JIKI_SHOT_04,		/* こうもり弾2 / 黄札2 */
	{  1, 64, 32, 32},//	JIKI_SHOT_05,		/* こうもり弾3 / 黄札3 */
	{  1, 64, 32, 32},//	JIKI_SHOT_06,		/* こうもり弾4 / 黄札4 */
	{138,  0, 15, 14},//	JIKI_SHOT_07,		/* こうもり弾5 / 針弾 / 森弾 / ウェイブ弾 / ピンク蝶弾 */
// [5]
	{  0,128, 16, 15},//	JIKI_OPTION_00_00,
	{ 16,128, 16, 15},//	JIKI_OPTION_00_01,
	{ 32,128, 16, 15},//	JIKI_OPTION_00_02,
	{ 48,128, 16, 15},//	JIKI_OPTION_00_03,
	{ 64,128, 16, 15},//	JIKI_OPTION_00_04,
	{ 80,128, 16, 15},//	JIKI_OPTION_00_05,
	{ 96,128, 16, 15},//	JIKI_OPTION_00_06,
	{112,128, 16, 15},//	JIKI_OPTION_00_07,
// [6]
	{  0,144, 16, 15},//	JIKI_OPTION_01_00,
	{ 16,144, 16, 15},//	JIKI_OPTION_01_01,
	{ 32,144, 16, 15},//	JIKI_OPTION_01_02,
	{ 48,144, 16, 15},//	JIKI_OPTION_01_03,
	{ 64,144, 16, 15},//	JIKI_OPTION_01_04,
	{ 80,144, 16, 15},//	JIKI_OPTION_01_05,
	{ 96,144, 16, 15},//	JIKI_OPTION_01_06,
	{112,144, 16, 15},//	JIKI_OPTION_01_07,
// [7]
	{  0,160, 16, 15},//	JIKI_OPTION_02_00,
	{ 16,160, 16, 15},//	JIKI_OPTION_02_01,
	{ 32,160, 16, 15},//	JIKI_OPTION_02_02,
	{ 48,160, 16, 15},//	JIKI_OPTION_02_03,
	{ 64,160, 16, 15},//	JIKI_OPTION_02_04,
	{ 80,160, 16, 15},//	JIKI_OPTION_02_05,
	{ 96,160, 16, 15},//	JIKI_OPTION_02_06,
	{112,160, 16, 15},//	JIKI_OPTION_02_07,
// [8]
	{  0,176, 16, 15},//	JIKI_OPTION_03_00,
	{ 16,176, 16, 15},//	JIKI_OPTION_03_01,
	{ 32,176, 16, 15},//	JIKI_OPTION_03_02,
	{ 48,176, 16, 15},//	JIKI_OPTION_03_03,
	{ 64,176, 16, 15},//	JIKI_OPTION_03_04,
	{ 80,176, 16, 15},//	JIKI_OPTION_03_05,
	{ 96,176, 16, 15},//	JIKI_OPTION_03_06,
	{112,176, 16, 15},//	JIKI_OPTION_03_07,


/* --- ITEM面 ---
現状だと著しく効率悪い気がする
*/
/* [OBJ_BANK_06_ITEM] */
// [1]
	{ 65, 22, 10, 10},//	SP_ITEM_00_P001 	/* [p]小 */
	{ 76, 20, 12, 12},//	SP_ITEM_01_P008,	/* [P]大 */
	{ 89, 20, 12, 12},//	SP_ITEM_04_P128,	/* [F] */
	{102, 20, 12, 12},//	SP_ITEM_03_1UP, 	/* [1up] */
	{115, 20, 12, 12},//	SP_ITEM_02_BOMB, 	/* [B] */
	{ 54, 22, 10, 10},//	SP_ITEM_06_TENSU, 	/* [点] */
	{  0,  9, 10, 10},//	SP_ITEM_05_HOSI,	/* [☆] */	/* とりあえず */
	{  1,  1,  1,  1},//	SP_ITEM_07_SPECIAL,
// [2]
	{113, 87,  8,  6},//	SP_ITEM_00_P001 	/* [p]小 */
	{ 64, 87,  9,  8},//	SP_ITEM_01_P008,	/* [P]大 */
	{ 74, 87,  9,  8},//	SP_ITEM_04_P128,	/* [F] */
	{ 84, 87,  9,  8},//	SP_ITEM_03_1UP, 	/* [1up] */
	{ 94, 87,  9,  8},//	SP_ITEM_02_BOMB, 	/* [B] */
	{104, 87,  8,  6},//	SP_ITEM_06_TENSU, 	/* [点] */
	{  1,  1,  1,  1},//	SP_ITEM_05_HOSI,	/* [☆] */
	{  1,  1,  1,  1},//	SP_ITEM_07_SPECIAL,
// [3]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [4]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [5]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [6]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [7]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [8]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,

/* --- フロント面 --- */
/* [OBJ_BANK_07_FRONT_BANK0] */
// [1]
	{  1,129,  4,  4},//	JIKI_CORE_00_REIMU_A
	{  1,129,  4,  4},//	JIKI_CORE_01_REIMU_B
	{  6,129,  6,  6},//	JIKI_CORE_02_MARISA_A
	{  6,129,  6,  6},//	JIKI_CORE_03_MARISA_B
	{ 13,129,  6,  6},//	JIKI_CORE_05_REMILIA
	{ 27,129,  5,  6},//	JIKI_CORE_07_YUYUKO
	{ 20,129,  6,  6},//	JIKI_CORE_06_CHIRNO_A
	{ 20,129,  6,  6},//	JIKI_CORE_06_CHIRNO_Q
// [2]//	/* 小爆発 / ザコ消滅爆発(フロント面エフェクト) */
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [3]//	/* 火炎爆発(フロント面エフェクト) */
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [4]
	{240,  0, 16, 16},//	SPELL_SQUERE_,	/* [□] */
	{  0,  0,  1,  1},//	SP_GROUP_ETC_DUMMY_REMILIA,
	{  0,  0,  1,  1},//	SP_GROUP_ETC_DUMMY_SLOW_BOMB,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [5]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [6]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [7]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
// [8]
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,
	{  0,112, 15, 15},//	J,

/* [OBJ_BANK_08_PANEL] */

/* --- 魔方陣 --- */
/* [OBJ_BANK_09_EFFECT] */	/*[予定]*/


/* --- 敵面 --- */

/* [OBJ_BANK_0a_TEKI_STAGE1] */
// [1]
	{  0,  0, 38, 55},//	J,	TEKI_00_BOSS11	= /*0x0400*/SP_GROUP_ZAKO,
	{ 39,  0, 38, 55},//	J,	TEKI_01_BOSS12,
	{ 78,  0, 38, 55},//	J,	TEKI_02_BOSS13,
	{117,  0, 38, 55},//	J,	TEKI_03_BOSS14,
	{  0, 56, 38, 55},//	J,	TEKI_04_BOSS21,
	{ 39, 56, 38, 55},//	J,	TEKI_05_BOSS22,
	{ 78, 56, 38, 55},//	J,	TEKI_06_BOSS23,
	{117, 56, 38, 55},//	J,	TEKI_07_BOSS24,
// [2]                        //
	{  0,112, 38, 55},//	J,	TEKI_08_BOSS31,
	{ 39,112, 38, 55},//	J,	TEKI_09_BOSS32,
	{ 78,112, 38, 55},//	J,	TEKI_10_BOSS33,
	{117,112, 38, 55},//	J,	TEKI_11_BOSS34,
	{180,115, 18, 20},//	J,	TEKI_12_OBAKE01,
	{199,115, 18, 20},//	J,	TEKI_13_OBAKE02,
	{218,115, 18, 20},//	J,	TEKI_14_OBAKE03,
	{237,115, 18, 20},//	J,	TEKI_15_OBAKE04,
// [3]                        //
	{172,  1, 20, 18},//	J,	TEKI_16_YOUSEI11,
	{193,  1, 20, 18},//	J,	TEKI_17_YOUSEI12,
	{214,  1, 20, 18},//	J,	TEKI_18_YOUSEI13,
	{235,  1, 20, 18},//	J,	TEKI_19_YOUSEI14,
	{172, 20, 20, 18},//	J,	TEKI_20_YOUSEI21,
	{193, 20, 20, 18},//	J,	TEKI_21_YOUSEI22,
	{214, 20, 20, 18},//	J,	TEKI_22_YOUSEI23,
	{235, 20, 20, 18},//	J,	TEKI_23_YOUSEI24,
// [4]                        //
	{172, 39, 20, 18},//	J,	TEKI_24_YOUSEI31,
	{193, 39, 20, 18},//	J,	TEKI_25_YOUSEI32,
	{214, 39, 20, 18},//	J,	TEKI_26_YOUSEI33,
	{235, 39, 20, 18},//	J,	TEKI_27_YOUSEI34,
	{172, 58, 20, 18},//	J,	TEKI_28_YOUSEI41,
	{193, 58, 20, 18},//	J,	TEKI_29_YOUSEI42,
	{214, 58, 20, 18},//	J,	TEKI_30_YOUSEI43,
	{235, 58, 20, 18},//	J,	TEKI_31_YOUSEI44,
// [5]                        //
	{172, 77, 20, 18},//	J,	TEKI_32_YOUSEI51,
	{193, 77, 20, 18},//	J,	TEKI_33_YOUSEI52,
	{214, 77, 20, 18},//	J,	TEKI_34_YOUSEI53,
	{235, 77, 20, 18},//	J,	TEKI_35_YOUSEI54,
	{172, 96, 20, 18},//	J,	TEKI_36_YOUSEI61,
	{193, 96, 20, 18},//	J,	TEKI_37_YOUSEI62,
	{214, 96, 20, 18},//	J,	TEKI_38_YOUSEI63,
	{235, 96, 20, 18},//	J,	TEKI_39_YOUSEI64,
// [6]                        //
	{144,168, 27, 27},//	J,	TEKI_40_CHUU_YOUSEI1,
	{172,168, 27, 27},//	J,	TEKI_41_CHUU_YOUSEI2,
	{200,168, 27, 27},//	J,	TEKI_42_CHUU_YOUSEI3,
	{228,168, 27, 27},//	J,	TEKI_43_CHUU_YOUSEI4,
	{144,197, 27, 27},//	J,	TEKI_44_CHUU_YOUSEI5,
	{172,197, 27, 27},//	J,	TEKI_45_CHUU_YOUSEI6,
	{200,197, 27, 27},//	J,	TEKI_46_CHUU_YOUSEI7,
	{228,197, 27, 27},//	J,	TEKI_47_CHUU_YOUSEI8,
// [7]                        //
	{156,144, 24, 23},//	J,	TEKI_48_OBAKE1,
	{181,144, 24, 23},//	J,	TEKI_49_OBAKE2,
	{206,144, 24, 23},//	J,	TEKI_50_OBAKE3,
	{  1,175, 46, 46},//	J,	TEKI_51_MAHOJIN1,
	{ 48,173, 50, 50},//	J,	TEKI_52_MAHOJIN2,
	{ 99,177, 42, 42},//	J,	TEKI_53_INYOU_DAI,
	{ 19,227, 34, 28},//	J,	TEKI_54_CHOU1,
	{ 54,227, 34, 28},//	J,	TEKI_55_CHOU2,
// [8]                        //
	{  0,225, 18, 30},//	J,	TEKI_56_CHEN,
	{206,241, 12, 14},//	J,	TEKI_57_BLUE_BOOK,
	{219,241, 12, 14},//	J,	TEKI_58_RED_BOOK,
	{ 89,231, 24, 24},//	J,	TEKI_59_HAI_KEDAMA,
	{114,231, 24, 24},//	J,	TEKI_60_AKA_KEDAMA,
	{139,231, 24, 24},//	J,	TEKI_61_NIJI_HOSI,
	{164,235, 20, 20},//	J,	TEKI_62_TATSUMAKI,
	{192,238,  5, 15},//	J,	TEKI_63_HOMING_STUFF,

/* [OBJ_BANK_0b_TEKI_STAGE2] */
/* [OBJ_BANK_0c_TEKI_STAGE3] */
/* [OBJ_BANK_0d_TEKI_STAGE4] */
/* [OBJ_BANK_0e_TEKI_STAGE5] */
/* [OBJ_BANK_0f_TEKI_STAGE6] */
/* [OBJ_BANK_10_TEKI_STAGE7_dummy] */
/* [OBJ_BANK_11_TEKI_STAGE8] */

};

