
/*---------------------------------------------------------
	東方模倣風 ～ Toho Imitation Style.
	プロジェクトページ http://code.google.com/p/kene-touhou-mohofu/
	-------------------------------------------------------
	"陰陽玉1",		"PLASMABALL",
	-------------------------------------------------------
	(旧)白毛玉、(601氏)青妖精
	(4*6)で24匹も出てくるがあまり意味のないキャラ
	-------------------------------------------------------
	花映塚風(?)に変えた。
	かなりテキトー。
---------------------------------------------------------*/


/*---------------------------------------------------------
	敵移動
---------------------------------------------------------*/

static void move_inyou1(SPRITE *src)
{
	src->cx256 += src->vx256;
	/* 画面両端では、跳ね返る */
	if (
		((t256(0)) > (src->cx256) ) ||
		((t256(GAME_WIDTH)) < (src->cx256) ) )
	{
		src->vx256 = -src->vx256;
	}
	/* 移動向きに合わせてグラ回転 */
	if (0 < src->vx256)
			{	src->zako_anime_rotate_angle1024 = ( 24);	}
	else	{	src->zako_anime_rotate_angle1024 = (-24);	}
	/* 落ちる */
	if ((t256(2.50)) > src->vy256)	/* 最大重力加速度 */
	{
		src->vy256 += (8);	/* 重力加速度 */
	}
	/* */
	src->cy256 += src->vy256;
	if ( (src->limit_y256) < (src->cy256) )
	{
	//	src->cy256			= src->limit_y256;
		src->limit_y256 	= t256(300);
		src->vy256			= -src->vy256;	/* 跳ねる */
	}
	/* 画面下まで来たら、おしまい */
	if (t256(272) < (src->cy256) )
	{
		src->jyumyou = JYUMYOU_NASI;	/* おしまい */
	}
	/* アニメーション */
	zako_anime_type04(src);
}


/*---------------------------------------------------------
	敵を追加する
---------------------------------------------------------*/

static void regist_zako_002_inyou1(GAME_COMMAND *l, SPRITE *h)
{
	h->callback_loser		= item_create_002_inyou_zako;
	h->limit_y256			= (t256(128)-((/*yyy*/(l->user_kougeki_type)&0x0f)<<(5+8)));		/* 閾値 */
							/*t256(200)-(j*t256(40))*/
							/*(-(xxx*t256(20))-(yyy*t256(50)))*/
	h->vx256				= (ra_nd()&0x1ff);
	h->vy256				= (ra_nd()&0x1ff);
}
