
#------------------------------------------------------------------------------
#  東方模倣風 ～ Toho Imitation Style.  Included Makefile for custom library 
#------------------------------------------------------------------------------

#------------------------------------------------------------------------------
# Gu 関連
#------------------------------------------------------------------------------

### libgu
ifneq ($(filter -lpspgu,$(LIBS)),)
	# 標準ライブラリを使う
else
	# カスタムライブラリを使う
	LIB_PSP_GU_OBJS += $(OBJ)/libgu/pgc.o

	OBJS += $(OBJ)/libgu/libgu_tiny.a
	OBJDIRS += $(OBJ)/libgu
	INCDIR += $(SRC)/libgu
endif
